codeljo/riscv-bare-metal/esp32c3/include/registers.inc
######################################################
# ESP32-C3
######################################################

######################################################
# Configuration and Status Registers (CSRs)
# (TRM 29)
######################################################
# Machine Information CSRs
.equ mvendorid, 0xF11
.equ marchid,   0xF12
.equ mimpid,    0xF13
.equ mhartid,   0xF14
# Machine Trap Setup CSRs
.equ mstatus,   0x300
.equ misa,      0x301
.equ mtvec,     0x305
# Machine Trap Handling CSRs
.equ mscratch,  0x340
.equ mepc,      0x341
.equ mcause,    0x342
.equ mtval,     0x343
# Physical Memory Protection (PMP) CSRs
.equ pmpcfg0,   0x3A0
.equ pmpcfg1,   0x3A1
.equ pmpcfg2,   0x3A2
.equ pmpcfg3,   0x3A3
.equ pmpaddr0,  0x3B0
.equ pmpaddr1,  0x3B1
.equ pmpaddr2,  0x3B2
.equ pmpaddr3,  0x3B3
.equ pmpaddr4,  0x3B4
.equ pmpaddr5,  0x3B5
.equ pmpaddr6,  0x3B6
.equ pmpaddr7,  0x3B7
.equ pmpaddr8,  0x3B8
.equ pmpaddr9,  0x3B9
.equ pmpaddr10, 0x3BA
.equ pmpaddr11, 0x3BB
.equ pmpaddr12, 0x3BC
.equ pmpaddr13, 0x3BD
.equ pmpaddr14, 0x3BE
.equ pmpaddr15, 0x3BF
# Trigger Module CSRs (shared with Debug Mode)
.equ tselect,   0x7A0
.equ tdata1,    0x7A1
.equ tdata2,    0x7A2
.equ tcontrol,  0x7A5
# Debug Mode CSRs
.equ dcsr,      0x7B0
.equ dpc,       0x7B1
.equ dscratch0, 0x7B2
.equ dscratch1, 0x7B3
# Performance Counter CSRs (Custom)
.equ mpcer,     0x7E0
.equ mpcmr,     0x7E1
.equ mpccr,     0x7E2
# GPIO Access CSRs (Custom)
# .equ cpu_gpio_oen, 0x803
# .equ cpu_gpio_oen, 0x804
# .equ cpu_gpio_oen, 0x805
######################################################

######################################################
# GDMA Controller (GDMA)
# (TRM 66)
######################################################
.equ GDMA_BASE,  0x6003F000
# Interrupt Registers
.equ GDMA_INT_RAW_CH0_REG,                0x6003F000
.equ GDMA_INT_ST_CH0_REG,                 0x6003F004
.equ GDMA_INT_ENA_CH0_REG,                0x6003F008
.equ GDMA_INT_CLR_CH0_REG,                0x6003F00C
.equ GDMA_INT_RAW_CH1_REG,                0x6003F010
.equ GDMA_INT_ST_CH1_REG,                 0x6003F014
.equ GDMA_INT_ENA_CH1_REG,                0x6003F018
.equ GDMA_INT_CLR_CH1_REG,                0x6003F01C
.equ GDMA_INT_RAW_CH2_REG,                0x6003F020
.equ GDMA_INT_ST_CH2_REG,                 0x6003F024
.equ GDMA_INT_ENA_CH2_REG,                0x6003F028
.equ GDMA_INT_CLR_CH2_REG,                0x6003F02C
# Configuration Register
.equ GDMA_MISC_CONF_REG,                  0x6003F044
# Version Register
.equ GDMA_DATE_REG,                       0x6003F048
# Configuration Registers
.equ GDMA_IN_CONF0_CH0_REG,               0x6003F070
.equ GDMA_IN_CONF1_CH0_REG,               0x6003F074
.equ GDMA_IN_POP_CH0_REG,                 0x6003F07C
.equ GDMA_IN_LINK_CH0_REG,                0x6003F080
.equ GDMA_OUT_CONF0_CH0_REG,              0x6003F0D0
.equ GDMA_OUT_CONF1_CH0_REG,              0x6003F0D4
.equ GDMA_OUT_PUSH_CH0_REG,               0x6003F0DC
.equ GDMA_OUT_LINK_CH0_REG,               0x6003F0E0     
.equ GDMA_IN_CONF0_CH1_REG,               0x6003F130
.equ GDMA_IN_CONF1_CH1_REG,               0x6003F134
.equ GDMA_IN_POP_CH1_REG,                 0x6003F13C
.equ GDMA_IN_LINK_CH1_REG,                0x6003F140
.equ GDMA_OUT_CONF0_CH1_REG,              0x6003F190
.equ GDMA_OUT_CONF1_CH1_REG,              0x6003F194
.equ GDMA_OUT_PUSH_CH1_REG,               0x6003F19C
.equ GDMA_OUT_LINK_CH1_REG,               0x6003F1A0
.equ GDMA_IN_CONF0_CH2_REG,               0x6003F1F0
.equ GDMA_IN_CONF1_CH2_REG,               0x6003F1F4
.equ GDMA_IN_POP_CH2_REG,                 0x6003F1FC
.equ GDMA_IN_LINK_CH2_REG,                0x6003F200
.equ GDMA_OUT_CONF0_CH2_REG,              0x6003F250
.equ GDMA_OUT_CONF1_CH2_REG,              0x6003F254
.equ GDMA_OUT_PUSH_CH2_REG,               0x6003F25C
.equ GDMA_OUT_LINK_CH2_REG,               0x6003F260
# Status Registers
.equ GDMA_INFIFO_STATUS_CH0_REG,          0x6003F078
.equ GDMA_IN_STATE_CH0_REG,               0x6003F084
.equ GDMA_IN_SUC_EOF_DES_ADDR_CH0_REG,    0x6003F088
.equ GDMA_IN_ERR_EOF_DES_ADDR_CH0_REG,    0x6003F08C
.equ GDMA_IN_DSCR_CH0_REG,                0x6003F090
.equ GDMA_IN_DSCR_BF0_CH0_REG,            0x6003F094
.equ GDMA_IN_DSCR_BF1_CH0_REG,            0x6003F098
.equ GDMA_OUTFIFO_STATUS_CH0_REG,         0x6003F0D8
.equ GDMA_OUT_STATE_CH0_REG,              0x6003F0E4
.equ GDMA_OUT_EOF_DES_ADDR_CH0_REG,       0x6003F0E8
.equ GDMA_OUT_EOF_BFR_DES_ADDR_CH0_REG,   0x6003F0EC
.equ GDMA_OUT_DSCR_CH0_REG,               0x6003F0F0
.equ GDMA_OUT_DSCR_BF0_CH0_REG,           0x6003F0F4
.equ GDMA_OUT_DSCR_BF1_CH0_REG,           0x6003F0F8
.equ GDMA_INFIFO_STATUS_CH1_REG,          0x6003F138
.equ GDMA_IN_STATE_CH1_REG,               0x6003F144
.equ GDMA_IN_SUC_EOF_DES_ADDR_CH1_REG,    0x6003F148
.equ GDMA_IN_ERR_EOF_DES_ADDR_CH1_REG,    0x6003F14C
.equ GDMA_IN_DSCR_CH1_REG,                0x6003F150
.equ GDMA_IN_DSCR_BF0_CH1_REG,            0x6003F154
.equ GDMA_IN_DSCR_BF1_CH1_REG,            0x6003F158
.equ GDMA_OUTFIFO_STATUS_CH1_REG,         0x6003F198
.equ GDMA_OUT_STATE_CH1_REG,              0x6003F1A4
.equ GDMA_OUT_EOF_DES_ADDR_CH1_REG,       0x6003F1A8
.equ GDMA_OUT_EOF_BFR_DES_ADDR_CH1_REG,   0x6003F1AC
.equ GDMA_OUT_DSCR_CH1_REG,               0x6003F1B0
.equ GDMA_OUT_DSCR_BF0_CH1_REG,           0x6003F1B4
.equ GDMA_OUT_DSCR_BF1_CH1_REG,           0x6003F1B8
.equ GDMA_INFIFO_STATUS_CH2_REG,          0x6003F1F8
.equ GDMA_IN_STATE_CH2_REG,               0x6003F204
.equ GDMA_IN_SUC_EOF_DES_ADDR_CH2_REG,    0x6003F208
.equ GDMA_IN_ERR_EOF_DES_ADDR_CH2_REG,    0x6003F20C
.equ GDMA_IN_DSCR_CH2_REG,                0x6003F210
.equ GDMA_IN_DSCR_BF0_CH2_REG,            0x6003F214
.equ GDMA_IN_DSCR_BF1_CH2_REG,            0x6003F218
.equ GDMA_OUTFIFO_STATUS_CH2_REG,         0x6003F258
.equ GDMA_OUT_STATE_CH2_REG,              0x6003F264
.equ GDMA_OUT_EOF_DES_ADDR_CH2_REG,       0x6003F268
.equ GDMA_OUT_EOF_BFR_DES_ADDR_CH2_REG,   0x6003F26C
.equ GDMA_OUT_DSCR_CH2_REG,               0x6003F270
.equ GDMA_OUT_DSCR_BF0_CH2_REG,           0x6003F274
.equ GDMA_OUT_DSCR_BF1_CH2_REG,           0x6003F278
# Priority Registers
.equ GDMA_IN_PRI_CH0_REG,                 0x6003F09C
.equ GDMA_OUT_PRI_CH0_REG,                0x6003F0FC
.equ GDMA_IN_PRI_CH1_REG,                 0x6003F15C
.equ GDMA_OUT_PRI_CH1_REG,                0x6003F1BC
.equ GDMA_IN_PRI_CH2_REG,                 0x6003F21C
.equ GDMA_OUT_PRI_CH2_REG,                0x6003F27C
# Peripheral Select Registers
.equ GDMA_IN_PERI_SEL_CH0_REG,            0x6003F0A0
.equ GDMA_OUT_PERI_SEL_CH0_REG,           0x6003F100
.equ GDMA_IN_PERI_SEL_CH1_REG,            0x6003F160
.equ GDMA_OUT_PERI_SEL_CH1_REG,           0x6003F1C0
.equ GDMA_IN_PERI_SEL_CH2_REG,            0x6003F220
.equ GDMA_OUT_PERI_SEL_CH2_REG,           0x6003F280
######################################################

######################################################
# eFuse Controller (EFUSE)
# (TRM 108) (TODO)
######################################################
.equ EFUSE_BASE,            0x6001A000
######################################################

######################################################
# GPIO (GPIO)
# (TRM 170)
######################################################
.equ GPIO_BASE,             0x60004000
# Configuration Registers
.equ GPIO_BT_SELECT_REG,    0x60004000
.equ GPIO_OUT_REG,          0x60004004    # (reset: 0x00) (output value of GPIO0 - 30 output in simple GPIO output mode)
.equ GPIO_OUT_W1TS_REG,     0x60004008
.equ GPIO_OUT_W1TC_REG,     0x6000400C
.equ GPIO_ENABLE_REG,       0x60004020    # (reset: 0x00) (configures whether or not to enable the output of GPIO0 - GPIO30)
.equ GPIO_ENABLE_W1TS_REG,  0x60004024
.equ GPIO_ENABLE_W1TC_REG,  0x60004028
.equ GPIO_STRAP_REG,        0x60004038
.equ GPIO_IN_REG,           0x6000403C    # (reset: 0x00) (input value of GPIO0 - GPIO30)
.equ GPIO_STATUS_REG,       0x60004044      
.equ GPIO_STATUS_W1TS_REG,  0x60004048
.equ GPIO_STATUS_W1TC_REG,  0x6000404C
.equ GPIO_PCPU_INT_REG,     0x6000405C
.equ GPIO_STATUS_NEXT_REG,  0x6000414C
# Pin Configuration Registers
.equ GPIO_PIN0_REG,         0x60004074
.equ GPIO_PIN1_REG,         0x60004078
.equ GPIO_PIN2_REG,         0x6000407C
.equ GPIO_PIN3_REG,         0x60004080
.equ GPIO_PIN4_REG,         0x60004084
.equ GPIO_PIN5_REG,         0x60004088
.equ GPIO_PIN6_REG,         0x6000408C
.equ GPIO_PIN7_REG,         0x60004090
.equ GPIO_PIN8_REG,         0x60004094
.equ GPIO_PIN9_REG,         0x60004098
.equ GPIO_PIN10_REG,        0x6000409C
.equ GPIO_PIN11_REG,        0x600040A0
.equ GPIO_PIN12_REG,        0x600040A4
.equ GPIO_PIN13_REG,        0x600040A8
.equ GPIO_PIN14_REG,        0x600040AC
.equ GPIO_PIN15_REG,        0x600040B0
.equ GPIO_PIN16_REG,        0x600040B4
.equ GPIO_PIN17_REG,        0x600040B8
.equ GPIO_PIN18_REG,        0x600040BC
.equ GPIO_PIN19_REG,        0x600040C0
.equ GPIO_PIN20_REG,        0x600040C4
.equ GPIO_PIN21_REG,        0x600040C8
# Input Function Configuration Registers
.equ GPIO_FUNC0_IN_SEL_CFG_REG,   0x60004154
.equ GPIO_FUNC1_IN_SEL_CFG_REG,   0x60004158
.equ GPIO_FUNC2_IN_SEL_CFG_REG,   0x6000415C
.equ GPIO_FUNC3_IN_SEL_CFG_REG,   0x60004160
.equ GPIO_FUNC4_IN_SEL_CFG_REG,   0x60004164
.equ GPIO_FUNC5_IN_SEL_CFG_REG,   0x60004168
.equ GPIO_FUNC6_IN_SEL_CFG_REG,   0x6000416C
.equ GPIO_FUNC7_IN_SEL_CFG_REG,   0x60004170
.equ GPIO_FUNC8_IN_SEL_CFG_REG,   0x60004174
.equ GPIO_FUNC9_IN_SEL_CFG_REG,   0x60004178
.equ GPIO_FUNC10_IN_SEL_CFG_REG,  0x6000417C
.equ GPIO_FUNC11_IN_SEL_CFG_REG,  0x60004180
.equ GPIO_FUNC12_IN_SEL_CFG_REG,  0x60004184
.equ GPIO_FUNC13_IN_SEL_CFG_REG,  0x60004188
.equ GPIO_FUNC14_IN_SEL_CFG_REG,  0x6000418C
.equ GPIO_FUNC15_IN_SEL_CFG_REG,  0x60004190
.equ GPIO_FUNC16_IN_SEL_CFG_REG,  0x60004194
.equ GPIO_FUNC17_IN_SEL_CFG_REG,  0x60004198
.equ GPIO_FUNC18_IN_SEL_CFG_REG,  0x6000419C
.equ GPIO_FUNC19_IN_SEL_CFG_REG,  0x600041A0
.equ GPIO_FUNC20_IN_SEL_CFG_REG,  0x600041A4
.equ GPIO_FUNC21_IN_SEL_CFG_REG,  0x600041A8
.equ GPIO_FUNC22_IN_SEL_CFG_REG,  0x600041AC
.equ GPIO_FUNC23_IN_SEL_CFG_REG,  0x600041B0
.equ GPIO_FUNC24_IN_SEL_CFG_REG,  0x600041B4
.equ GPIO_FUNC25_IN_SEL_CFG_REG,  0x600041B8
.equ GPIO_FUNC26_IN_SEL_CFG_REG,  0x600041BC
.equ GPIO_FUNC27_IN_SEL_CFG_REG,  0x600041C0
.equ GPIO_FUNC28_IN_SEL_CFG_REG,  0x600041C4
.equ GPIO_FUNC29_IN_SEL_CFG_REG,  0x600041C8
.equ GPIO_FUNC30_IN_SEL_CFG_REG,  0x600041CC
.equ GPIO_FUNC31_IN_SEL_CFG_REG,  0x600041D0
.equ GPIO_FUNC32_IN_SEL_CFG_REG,  0x600041D4
.equ GPIO_FUNC33_IN_SEL_CFG_REG,  0x600041D8
.equ GPIO_FUNC34_IN_SEL_CFG_REG,  0x600041DC
.equ GPIO_FUNC35_IN_SEL_CFG_REG,  0x600041E0
.equ GPIO_FUNC36_IN_SEL_CFG_REG,  0x600041E4
.equ GPIO_FUNC37_IN_SEL_CFG_REG,  0x600041E8
.equ GPIO_FUNC38_IN_SEL_CFG_REG,  0x600041EC
.equ GPIO_FUNC39_IN_SEL_CFG_REG,  0x600041F0
.equ GPIO_FUNC40_IN_SEL_CFG_REG,  0x600041F4
.equ GPIO_FUNC41_IN_SEL_CFG_REG,  0x600041F8
.equ GPIO_FUNC42_IN_SEL_CFG_REG,  0x600041FC
.equ GPIO_FUNC43_IN_SEL_CFG_REG,  0x60004200
.equ GPIO_FUNC44_IN_SEL_CFG_REG,  0x60004204
.equ GPIO_FUNC45_IN_SEL_CFG_REG,  0x60004208
.equ GPIO_FUNC46_IN_SEL_CFG_REG,  0x6000420C
.equ GPIO_FUNC47_IN_SEL_CFG_REG,  0x60004210
.equ GPIO_FUNC48_IN_SEL_CFG_REG,  0x60004214
.equ GPIO_FUNC49_IN_SEL_CFG_REG,  0x60004218
.equ GPIO_FUNC50_IN_SEL_CFG_REG,  0x6000421C
.equ GPIO_FUNC51_IN_SEL_CFG_REG,  0x60004220
.equ GPIO_FUNC52_IN_SEL_CFG_REG,  0x60004224
.equ GPIO_FUNC53_IN_SEL_CFG_REG,  0x60004228
.equ GPIO_FUNC54_IN_SEL_CFG_REG,  0x6000422C
.equ GPIO_FUNC55_IN_SEL_CFG_REG,  0x60004230
.equ GPIO_FUNC56_IN_SEL_CFG_REG,  0x60004234
.equ GPIO_FUNC57_IN_SEL_CFG_REG,  0x60004238
.equ GPIO_FUNC58_IN_SEL_CFG_REG,  0x6000423C
.equ GPIO_FUNC59_IN_SEL_CFG_REG,  0x60004240
.equ GPIO_FUNC60_IN_SEL_CFG_REG,  0x60004244
.equ GPIO_FUNC61_IN_SEL_CFG_REG,  0x60004248
.equ GPIO_FUNC62_IN_SEL_CFG_REG,  0x6000424C
.equ GPIO_FUNC63_IN_SEL_CFG_REG,  0x60004250
.equ GPIO_FUNC64_IN_SEL_CFG_REG,  0x60004254
.equ GPIO_FUNC65_IN_SEL_CFG_REG,  0x60004258
.equ GPIO_FUNC66_IN_SEL_CFG_REG,  0x6000425C
.equ GPIO_FUNC67_IN_SEL_CFG_REG,  0x60004260
.equ GPIO_FUNC68_IN_SEL_CFG_REG,  0x60004264
.equ GPIO_FUNC69_IN_SEL_CFG_REG,  0x60004268
.equ GPIO_FUNC70_IN_SEL_CFG_REG,  0x6000426C
.equ GPIO_FUNC71_IN_SEL_CFG_REG,  0x60004270
.equ GPIO_FUNC72_IN_SEL_CFG_REG,  0x60004274
.equ GPIO_FUNC73_IN_SEL_CFG_REG,  0x60004278
.equ GPIO_FUNC74_IN_SEL_CFG_REG,  0x6000427C
.equ GPIO_FUNC75_IN_SEL_CFG_REG,  0x60004280
.equ GPIO_FUNC76_IN_SEL_CFG_REG,  0x60004284
.equ GPIO_FUNC77_IN_SEL_CFG_REG,  0x60004288
.equ GPIO_FUNC78_IN_SEL_CFG_REG,  0x6000428C
.equ GPIO_FUNC79_IN_SEL_CFG_REG,  0x60004290
.equ GPIO_FUNC80_IN_SEL_CFG_REG,  0x60004294
.equ GPIO_FUNC81_IN_SEL_CFG_REG,  0x60004298
.equ GPIO_FUNC82_IN_SEL_CFG_REG,  0x6000429C
.equ GPIO_FUNC83_IN_SEL_CFG_REG,  0x600042A0
.equ GPIO_FUNC84_IN_SEL_CFG_REG,  0x600042A4
.equ GPIO_FUNC85_IN_SEL_CFG_REG,  0x600042A8
.equ GPIO_FUNC86_IN_SEL_CFG_REG,  0x600042AC
.equ GPIO_FUNC87_IN_SEL_CFG_REG,  0x600042B0
.equ GPIO_FUNC88_IN_SEL_CFG_REG,  0x600042B4
.equ GPIO_FUNC89_IN_SEL_CFG_REG,  0x600042B8
.equ GPIO_FUNC90_IN_SEL_CFG_REG,  0x600042BC
.equ GPIO_FUNC91_IN_SEL_CFG_REG,  0x600042C0
.equ GPIO_FUNC92_IN_SEL_CFG_REG,  0x600042C4
.equ GPIO_FUNC93_IN_SEL_CFG_REG,  0x600042C8
.equ GPIO_FUNC94_IN_SEL_CFG_REG,  0x600042CC
.equ GPIO_FUNC95_IN_SEL_CFG_REG,  0x600042D0
.equ GPIO_FUNC96_IN_SEL_CFG_REG,  0x600042D4
.equ GPIO_FUNC97_IN_SEL_CFG_REG,  0x600042D8
.equ GPIO_FUNC98_IN_SEL_CFG_REG,  0x600042DC
.equ GPIO_FUNC99_IN_SEL_CFG_REG,  0x600042E0
.equ GPIO_FUNC100_IN_SEL_CFG_REG, 0x600042E4
.equ GPIO_FUNC101_IN_SEL_CFG_REG, 0x600042E8
.equ GPIO_FUNC102_IN_SEL_CFG_REG, 0x600042EC
.equ GPIO_FUNC103_IN_SEL_CFG_REG, 0x600042F0
.equ GPIO_FUNC104_IN_SEL_CFG_REG, 0x600042F4
.equ GPIO_FUNC105_IN_SEL_CFG_REG, 0x600042F8
.equ GPIO_FUNC106_IN_SEL_CFG_REG, 0x600042FC
.equ GPIO_FUNC107_IN_SEL_CFG_REG, 0x60004300
.equ GPIO_FUNC108_IN_SEL_CFG_REG, 0x60004304
.equ GPIO_FUNC109_IN_SEL_CFG_REG, 0x60004308
.equ GPIO_FUNC110_IN_SEL_CFG_REG, 0x6000430C
.equ GPIO_FUNC111_IN_SEL_CFG_REG, 0x60004310
.equ GPIO_FUNC112_IN_SEL_CFG_REG, 0x60004314
.equ GPIO_FUNC113_IN_SEL_CFG_REG, 0x60004318
.equ GPIO_FUNC114_IN_SEL_CFG_REG, 0x6000431C
.equ GPIO_FUNC115_IN_SEL_CFG_REG, 0x60004320
.equ GPIO_FUNC116_IN_SEL_CFG_REG, 0x60004324
.equ GPIO_FUNC117_IN_SEL_CFG_REG, 0x60004328
.equ GPIO_FUNC118_IN_SEL_CFG_REG, 0x6000432C
.equ GPIO_FUNC119_IN_SEL_CFG_REG, 0x60004330
.equ GPIO_FUNC120_IN_SEL_CFG_REG, 0x60004334
.equ GPIO_FUNC121_IN_SEL_CFG_REG, 0x60004338
.equ GPIO_FUNC122_IN_SEL_CFG_REG, 0x6000433C
.equ GPIO_FUNC123_IN_SEL_CFG_REG, 0x60004340
.equ GPIO_FUNC124_IN_SEL_CFG_REG, 0x60004344
.equ GPIO_FUNC125_IN_SEL_CFG_REG, 0x60004348
.equ GPIO_FUNC126_IN_SEL_CFG_REG, 0x6000434C
.equ GPIO_FUNC127_IN_SEL_CFG_REG, 0x60004350
# Output Function Configuration Registers
.equ GPIO_FUNC0_OUT_SEL_CFG_REG,  0x60004554
.equ GPIO_FUNC1_OUT_SEL_CFG_REG,  0x60004558
.equ GPIO_FUNC2_OUT_SEL_CFG_REG,  0x6000455C
.equ GPIO_FUNC3_OUT_SEL_CFG_REG,  0x60004560
.equ GPIO_FUNC4_OUT_SEL_CFG_REG,  0x60004564
.equ GPIO_FUNC5_OUT_SEL_CFG_REG,  0x60004568
.equ GPIO_FUNC6_OUT_SEL_CFG_REG,  0x6000456C
.equ GPIO_FUNC7_OUT_SEL_CFG_REG,  0x60004570
.equ GPIO_FUNC8_OUT_SEL_CFG_REG,  0x60004574
.equ GPIO_FUNC9_OUT_SEL_CFG_REG,  0x60004578
.equ GPIO_FUNC10_OUT_SEL_CFG_REG, 0x6000457C
.equ GPIO_FUNC11_OUT_SEL_CFG_REG, 0x60004580
.equ GPIO_FUNC12_OUT_SEL_CFG_REG, 0x60004584
.equ GPIO_FUNC13_OUT_SEL_CFG_REG, 0x60004588
.equ GPIO_FUNC14_OUT_SEL_CFG_REG, 0x6000458C
.equ GPIO_FUNC15_OUT_SEL_CFG_REG, 0x60004590
.equ GPIO_FUNC16_OUT_SEL_CFG_REG, 0x60004594
.equ GPIO_FUNC17_OUT_SEL_CFG_REG, 0x60004598
.equ GPIO_FUNC18_OUT_SEL_CFG_REG, 0x6000459C
.equ GPIO_FUNC19_OUT_SEL_CFG_REG, 0x600045A0
.equ GPIO_FUNC20_OUT_SEL_CFG_REG, 0x600045A4
.equ GPIO_FUNC21_OUT_SEL_CFG_REG, 0x600045A8
# Version Register
.equ GPIO_DATE_REG,               0x600046FC
# Clock Gate Register
.equ GPIO_CLOCK_GATE_REG,         0x6000462C
######################################################

######################################################
# IO MUX (IO MUX)
# (TRM 172)
######################################################
# Configuration Registers
.equ IO_MUX_BASE,                 0x60009000
.equ IO_MUX_PIN_CTRL_REG,         0x60009000
.equ IO_MUX_GPIO0_REG,            0x60009004
.equ IO_MUX_GPIO1_REG,            0x60009008
.equ IO_MUX_GPIO2_REG,            0x6000900C
.equ IO_MUX_GPIO3_REG,            0x60009010
.equ IO_MUX_GPIO4_REG,            0x60009014
.equ IO_MUX_GPIO5_REG,            0x60009018
.equ IO_MUX_GPIO6_REG,            0x6000901C
.equ IO_MUX_GPIO7_REG,            0x60009020
.equ IO_MUX_GPIO8_REG,            0x60009024
.equ IO_MUX_GPIO9_REG,            0x60009028
.equ IO_MUX_GPIO10_REG,           0x6000902C
.equ IO_MUX_GPIO11_REG,           0x60009030
.equ IO_MUX_GPIO12_REG,           0x60009034
.equ IO_MUX_GPIO13_REG,           0x60009038
.equ IO_MUX_GPIO14_REG,           0x6000903C
.equ IO_MUX_GPIO15_REG,           0x60009040
.equ IO_MUX_GPIO16_REG,           0x60009044
.equ IO_MUX_GPIO17_REG,           0x60009048
.equ IO_MUX_GPIO18_REG,           0x6000904C
.equ IO_MUX_GPIO19_REG,           0x60009050
.equ IO_MUX_GPIO20_REG,           0x60009054
.equ IO_MUX_GPIO21_REG,           0x60009058
# Version Register
.equ IO_MUX_DATE_REG,             0x600090FC
######################################################

######################################################
# SDM Registers
# (TRM 173)
######################################################
.equ GPIOSD_SIGMADELTA0_REG,      0x60004F00
.equ GPIOSD_SIGMADELTA1_REG,      0x60004F04
.equ GPIOSD_SIGMADELTA2_REG,      0x60004F08
.equ GPIOSD_SIGMADELTA3_REG,      0x60004F0C
.equ GPIOSD_SIGMADELTA_CG_REG,    0x60004F20
.equ GPIOSD_SIGMADELTA_VERSION_REG, 0x60004F28
######################################################

