codeljo/riscv-bare-metal/esp32c3/include/registers.inc
######################################################
# Interrupt Matrix (INTERRUPT)
# (TRM 201)
######################################################
.equ INTERRUPT_BASE,                                0x600C2000
# Interrupt Source Mapping Registers
.equ INTERRUPT_CORE0_PWR_INTR_MAP_REG,              0x600C2008
.equ INTERRUPT_CORE0_I2C_MST_INT_MAP_REG,           0x600C202C
.equ INTERRUPT_CORE0_SLC0_INTR_MAP_REG,             0x600C2030
.equ INTERRUPT_CORE0_SLC1_INTR_MAP_REG,             0x600C2034
.equ INTERRUPT_CORE0_APB_CTRL_INTR_MAP_REG,         0x600C2038
.equ INTERRUPT_CORE0_UHCI0_INTR_MAP_REG,            0x600C203C
.equ INTERRUPT_CORE0_GPIO_INTERRUPT_PRO_MAP_REG,    0x600C2040
.equ INTERRUPT_CORE0_SPI_INTR_1_MAP_REG,            0x600C2048
.equ INTERRUPT_CORE0_SPI_INTR_2_MAP_REG,            0x600C204C
.equ INTERRUPT_CORE0_I2S1_INT_MAP_REG,              0x600C2050
.equ INTERRUPT_CORE0_UART_INTR_MAP_REG,             0x600C2054
.equ INTERRUPT_CORE0_UART1_INTR_MAP_REG,            0x600C2058
.equ INTERRUPT_CORE0_LEDC_INT_MAP_REG,              0x600C205C
.equ INTERRUPT_CORE0_EFUSE_INT_MAP_REG,             0x600C2060
.equ INTERRUPT_CORE0_TWAI_INT_MAP_REG,              0x600C2064
.equ INTERRUPT_CORE0_USB_INTR_MAP_REG,              0x600C2068
.equ INTERRUPT_CORE0_RTC_CORE_INTR_MAP_REG,         0x600C206C
.equ INTERRUPT_CORE0_RMT_INTR_MAP_REG,              0x600C2070
.equ INTERRUPT_CORE0_I2C_EXT0_INTR_MAP_REG,         0x600C2074
.equ INTERRUPT_CORE0_TIMER_INT1_MAP_REG,            0x600C2078
.equ INTERRUPT_CORE0_TIMER_INT2_MAP_REG,            0x600C207C
.equ INTERRUPT_CORE0_TG_T0_INT_MAP_REG,             0x600C2080
.equ INTERRUPT_CORE0_TG_WDT_INT_MAP_REG,            0x600C2084
.equ INTERRUPT_CORE0_TG1_T0_INT_MAP_REG,            0x600C2088
.equ INTERRUPT_CORE0_TG1_WDT_INT_MAP_REG,           0x600C208C
.equ INTERRUPT_CORE0_CACHE_IA_INT_MAP_REG,          0x600C2090
.equ INTERRUPT_CORE0_SYSTIMER_TARGET0_INT_MAP_REG,  0x600C2094
.equ INTERRUPT_CORE0_SYSTIMER_TARGET1_INT_MAP_REG,  0x600C2098
.equ INTERRUPT_CORE0_SYSTIMER_TARGET2_INT_MAP_REG,  0x600C209C
.equ INTERRUPT_CORE0_SPI_MEM_REJECT_INTR_MAP_REG,   0x600C20A0
.equ INTERRUPT_CORE0_ICACHE_PRELOAD_INT_MAP_REG,    0x600C20A4
.equ INTERRUPT_CORE0_ICACHE_SYNC_INT_MAP_REG,       0x600C20A8
.equ INTERRUPT_CORE0_APB_ADC_INT_MAP_REG,           0x600C20AC
.equ INTERRUPT_CORE0_DMA_CH0_INT_MAP_REG,           0x600C20B0
.equ INTERRUPT_CORE0_DMA_CH1_INT_MAP_REG,           0x600C20B4
.equ INTERRUPT_CORE0_DMA_CH2_INT_MAP_REG,           0x600C20B8
.equ INTERRUPT_CORE0_RSA_INT_MAP_REG,               0x600C20BC
.equ INTERRUPT_CORE0_AES_INT_MAP_REG,               0x600C20C0
.equ INTERRUPT_CORE0_SHA_INT_MAP_REG,               0x600C20C4
.equ INTERRUPT_CORE0_CPU_INTR_FROM_CPU_0_MAP_REG,   0x600C20C8
.equ INTERRUPT_CORE0_CPU_INTR_FROM_CPU_1_MAP_REG,   0x600C20CC
.equ INTERRUPT_CORE0_CPU_INTR_FROM_CPU_2_MAP_REG,   0x600C20D0
.equ INTERRUPT_CORE0_CPU_INTR_FROM_CPU_3_MAP_REG,   0x600C20D4
.equ INTERRUPT_CORE0_ASSIST_DEBUG_INTR_MAP_REG,     0x600C20D8
.equ INTERRUPT_CORE0_DMA_APBPERI_PMS_MONITOR_VIOLATE_INTR_MAP_REG,     0x600C20DC
.equ INTERRUPT_CORE0_CORE_0_IRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_REG,    0x600C20E0
.equ INTERRUPT_CORE0_CORE_0_DRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_REG,    0x600C20E4
.equ INTERRUPT_CORE0_CORE_0_PIF_PMS_MONITOR_VIOLATE_INTR_MAP_REG,      0x600C20E8
.equ INTERRUPT_CORE0_CORE_0_PIF_PMS_MONITOR_VIOLATE_SIZE_INTR_MAP_REG, 0x600C20EC
.equ INTERRUPT_CORE0_BACKUP_PMS_VIOLATE_INTR_MAP_REG,                  0x600C20F0
.equ INTERRUPT_CORE0_CACHE_CORE0_ACS_INT_MAP_REG,                      0x600C20F4
# Interrupt Source Status Registers
.equ INTERRUPT_CORE0_INTR_STATUS_0_REG,             0x600C20F8
.equ INTERRUPT_CORE0_INTR_STATUS_1_REG,             0x600C20FC
# Clock Register
.equ INTERRUPT_CORE0_CLOCK_GATE_REG,                0x600C2100
# CPU Interrupt Registers
.equ INTERRUPT_CORE0_CPU_INT_ENABLE_REG,            0x600C2104
.equ INTERRUPT_CORE0_CPU_INT_TYPE_REG,              0x600C2108
.equ INTERRUPT_CORE0_CPU_INT_CLEAR_REG,             0x600C210C
.equ INTERRUPT_CORE0_CPU_INT_EIP_STATUS_REG,        0x600C2110
.equ INTERRUPT_CORE0_CPU_INT_PRI_1_REG,             0x600C2118
.equ INTERRUPT_CORE0_CPU_INT_PRI_2_REG,             0x600C211C
.equ INTERRUPT_CORE0_CPU_INT_PRI_3_REG,             0x600C2120
.equ INTERRUPT_CORE0_CPU_INT_PRI_4_REG,             0x600C2124
.equ INTERRUPT_CORE0_CPU_INT_PRI_5_REG,             0x600C2128
.equ INTERRUPT_CORE0_CPU_INT_PRI_6_REG,             0x600C212C
.equ INTERRUPT_CORE0_CPU_INT_PRI_7_REG,             0x600C2130
.equ INTERRUPT_CORE0_CPU_INT_PRI_8_REG,             0x600C2134
.equ INTERRUPT_CORE0_CPU_INT_PRI_9_REG,             0x600C2138
.equ INTERRUPT_CORE0_CPU_INT_PRI_10_REG,            0x600C213C
.equ INTERRUPT_CORE0_CPU_INT_PRI_11_REG,            0x600C2140
.equ INTERRUPT_CORE0_CPU_INT_PRI_12_REG,            0x600C2144
.equ INTERRUPT_CORE0_CPU_INT_PRI_13_REG,            0x600C2148
.equ INTERRUPT_CORE0_CPU_INT_PRI_14_REG,            0x600C214C
.equ INTERRUPT_CORE0_CPU_INT_PRI_15_REG,            0x600C2150
.equ INTERRUPT_CORE0_CPU_INT_PRI_16_REG,            0x600C2154
.equ INTERRUPT_CORE0_CPU_INT_PRI_17_REG,            0x600C2158
.equ INTERRUPT_CORE0_CPU_INT_PRI_18_REG,            0x600C215C
.equ INTERRUPT_CORE0_CPU_INT_PRI_19_REG,            0x600C2160
.equ INTERRUPT_CORE0_CPU_INT_PRI_20_REG,            0x600C2164
.equ INTERRUPT_CORE0_CPU_INT_PRI_21_REG,            0x600C2168
.equ INTERRUPT_CORE0_CPU_INT_PRI_22_REG,            0x600C216C
.equ INTERRUPT_CORE0_CPU_INT_PRI_23_REG,            0x600C2170
.equ INTERRUPT_CORE0_CPU_INT_PRI_24_REG,            0x600C2174
.equ INTERRUPT_CORE0_CPU_INT_PRI_25_REG,            0x600C2178
.equ INTERRUPT_CORE0_CPU_INT_PRI_26_REG,            0x600C217C
.equ INTERRUPT_CORE0_CPU_INT_PRI_27_REG,            0x600C2180
.equ INTERRUPT_CORE0_CPU_INT_PRI_28_REG,            0x600C2184
.equ INTERRUPT_CORE0_CPU_INT_PRI_29_REG,            0x600C2188
.equ INTERRUPT_CORE0_CPU_INT_PRI_30_REG,            0x600C218C
.equ INTERRUPT_CORE0_CPU_INT_PRI_31_REG,            0x600C2190
.equ INTERRUPT_CORE0_CPU_INT_THRESH_REG,            0x600C2194
# Version Register
.equ INTERRUPT_CORE0_INTERRUPT_DATE_REG,            0x600C27FC
######################################################

######################################################
# Low-power Management Registers
# (TRM 223)
######################################################
.equ LOW_POWER_MANAGEMENT_BASE,    0x60008000
.equ RTC_CNTL_OPTIONS0_REG,        0x60008000
.equ RTC_CNTL_SLP_TIMER0_REG,      0x60008004
.equ RTC_CNTL_SLP_TIMER1_REG,      0x60008008
.equ RTC_CNTL_TIME_UPDATE_REG,     0x6000800C
.equ RTC_CNTL_TIME_LOW0_REG,       0x60008010
.equ RTC_CNTL_TIME_HIGH0_REG,      0x60008014
.equ RTC_CNTL_STATE0_REG,          0x60008018
.equ RTC_CNTL_TIMER1_REG,          0x6000801C
.equ RTC_CNTL_TIMER2_REG,          0x60008020
.equ RTC_CNTL_TIMER5_REG,          0x6000802C
.equ RTC_CNTL_ANA_CONF_REG,        0x60008034
.equ RTC_CNTL_RESET_STATE_REG,     0x60008038
.equ RTC_CNTL_WAKEUP_STATE_REG,    0x6000803C
.equ RTC_CNTL_INT_ENA_RTC_REG,     0x60008040
.equ RTC_CNTL_INT_RAW_RTC_REG,     0x60008044
.equ RTC_CNTL_INT_ST_RTC_REG,      0x60008048
.equ RTC_CNTL_INT_CLR_RTC_REG,     0x6000804C
.equ RTC_CNTL_STORE0_REG,          0x60008050
.equ RTC_CNTL_STORE1_REG,          0x60008054
.equ RTC_CNTL_STORE2_REG,          0x60008058
.equ RTC_CNTL_STORE3_REG,          0x6000805C
.equ RTC_CNTL_EXT_XTL_CONF_REG,    0x60008060
.equ RTC_CNTL_EXT_WAKEUP_CONF_REG, 0x60008064
.equ RTC_CNTL_SLP_REJECT_CONF_REG, 0x60008068
.equ RTC_CNTL_CLK_CONF_REG,        0x60008070
.equ RTC_CNTL_SLOW_CLK_CONF_REG,   0x60008074
.equ RTC_CNTL_REG,                 0x60008080
.equ RTC_CNTL_PWC_REG,             0x60008084
.equ RTC_CNTL_DIG_PWC_REG,         0x60008088
.equ RTC_CNTL_DIG_ISO_REG,         0x6000808C
.equ RTC_CNTL_WDTCONFIG0_REG,      0x60008090
.equ RTC_CNTL_WDTCONFIG1_REG,      0x60008094
.equ RTC_CNTL_WDTCONFIG2_REG,      0x60008098
.equ RTC_CNTL_WDTCONFIG3_REG,      0x6000809C
.equ RTC_CNTL_WDTCONFIG4_REG,      0x600080A0
.equ RTC_CNTL_WDTFEED_REG,         0x600080A4
.equ RTC_CNTL_WDTWPROTECT_REG,     0x600080A8
.equ RTC_CNTL_SWD_CONF_REG,        0x600080AC
.equ RTC_CNTL_SWD_WPROTECT_REG,    0x600080B0
.equ RTC_CNTL_SW_CPU_STALL_REG,    0x600080B4
.equ RTC_CNTL_STORE4_REG,          0x600080B8
.equ RTC_CNTL_STORE5_REG,          0x600080BC
.equ RTC_CNTL_STORE6_REG,          0x600080C0
.equ RTC_CNTL_STORE7_REG,          0x600080C4
.equ RTC_CNTL_LOW_POWER_ST_REG,    0x600080C8
.equ RTC_CNTL_PAD_HOLD_REG,        0x600080D0
.equ RTC_CNTL_DIG_PAD_HOLD_REG,    0x600080D4
.equ RTC_CNTL_BROWN_OUT_REG,       0x600080D8
.equ RTC_CNTL_TIME_LOW1_REG,       0x600080DC
.equ RTC_CNTL_TIME_HIGH1_REG,      0x600080E0
.equ RTC_CNTL_XTAL32K_CLK_FACTOR_REG, 0x600080E4
.equ RTC_CNTL_XTAL32K_CONF_REG,       0x600080E8
.equ RTC_CNTL_USB_CONF_REG,           0x600080EC
.equ RTC_CNTL_SLP_REJECT_CAUSE_REG,   0x600080F0
.equ RTC_CNTL_OPTION1_REG,            0x600080F4
.equ RTC_CNTL_SLP_WAKEUP_CAUSE_REG,   0x600080F8
.equ RTC_CNTL_INT_ENA_RTC_W1TS_REG,   0x60008100
.equ RTC_CNTL_INT_ENA_RTC_W1TC_REG,   0x60008104
.equ RTC_CNTL_RETENTION_CTRL_REG,     0x60008108
.equ RTC_CNTL_GPIO_WAKEUP_REG,        0x60008110
.equ RTC_CNTL_SENSOR_CTRL_REG,        0x6000811C
######################################################

######################################################
# System Timer (SYSTIMER)
# (TRM 267)
######################################################
.equ SYSTIMER_BASE,               0x60023000
# Clock Control Register
.equ SYSTIMER_CONF_REG,           0x60023000
# UNIT0 Control and Configuration Registers
.equ SYSTIMER_UNIT0_OP_REG,       0x60023004
.equ SYSTIMER_UNIT0_LOAD_HI_REG,  0x6002300C
.equ SYSTIMER_UNIT0_LOAD_LO_REG,  0x60023010
.equ SYSTIMER_UNIT0_VALUE_HI_REG, 0x60023040
.equ SYSTIMER_UNIT0_VALUE_LO_REG, 0x60023044
.equ SYSTIMER_UNIT0_LOAD_REG,     0x6002305C
# UNIT1 Control and Configuration Registers
.equ SYSTIMER_UNIT1_OP_REG,       0x60023008
.equ SYSTIMER_UNIT1_LOAD_HI_REG,  0x60023014
.equ SYSTIMER_UNIT1_LOAD_LO_REG,  0x60023018
.equ SYSTIMER_UNIT1_VALUE_HI_REG, 0x60023048
.equ SYSTIMER_UNIT1_VALUE_LO_REG, 0x6002304C
.equ SYSTIMER_UNIT1_LOAD_REG,     0x60023060
# Comparator0 Control and Configuration Registers
.equ SYSTIMER_TARGET0_HI_REG,     0x6002301C
.equ SYSTIMER_TARGET0_LO_REG,     0x60023020
.equ SYSTIMER_TARGET0_CONF_REG,   0x60023034
.equ SYSTIMER_COMP0_LOAD_REG,     0x60023050
# Comparator1 Control and Configuration Registers
.equ SYSTIMER_TARGET1_HI_REG,     0x60023024
.equ SYSTIMER_TARGET1_LO_REG,     0x60023028
.equ SYSTIMER_TARGET1_CONF_REG,   0x60023038
.equ SYSTIMER_COMP1_LOAD_REG,     0x60023054
# Comparator2 Control and Configuration Registers
.equ SYSTIMER_TARGET2_HI_REG,     0x6002302C
.equ SYSTIMER_TARGET2_LO_REG,     0x60023030
.equ SYSTIMER_TARGET2_CONF_REG,   0x6002303C
.equ SYSTIMER_COMP2_LOAD_REG,     0x60023058
# Interrupt Registers
.equ SYSTIMER_INT_ENA_REG,        0x60023064
.equ SYSTIMER_INT_RAW_REG,        0x60023068
.equ SYSTIMER_INT_CLR_REG,        0x6002306C
.equ SYSTIMER_INT_ST_REG,         0x60023070
# Version Registers
.equ SYSTIMER_DATE_REG,           0x600230FC
######################################################

######################################################
# Timer Group (TIMG)
# (TRM 286) (timer group 0)
# (note: inserted a 0 to the register names)
######################################################
.equ TIMG0_BASE,             0x6001F000
# T0 control and configuration registers
.equ TIMG0_T0CONFIG_REG,     0x6001F000
.equ TIMG0_T0LO_REG,         0x6001F004
.equ TIMG0_T0HI_REG,         0x6001F008
.equ TIMG0_T0UPDATE_REG,     0x6001F00C
.equ TIMG0_T0ALARMLO_REG,    0x6001F010
.equ TIMG0_T0ALARMHI_REG,    0x6001F014
.equ TIMG0_T0LOADLO_REG,     0x6001F018
.equ TIMG0_T0LOADHI_REG,     0x6001F01C
.equ TIMG0_T0LOAD_REG,       0x6001F020
# WDT control and configuration registers
.equ TIMG0_WDTCONFIG0_REG,   0x6001F048
.equ TIMG0_WDTCONFIG1_REG,   0x6001F04C
.equ TIMG0_WDTCONFIG2_REG,   0x6001F050
.equ TIMG0_WDTCONFIG3_REG,   0x6001F054
.equ TIMG0_WDTCONFIG4_REG,   0x6001F058
.equ TIMG0_WDTCONFIG5_REG,   0x6001F05C
.equ TIMG0_WDTFEED_REG,      0x6001F060
.equ TIMG0_WDTWPROTECT_REG,  0x6001F064
# RTC frequency calculation control and configuration registers
.equ TIMG0_RTCCALICFG_REG,   0x6001F068
.equ TIMG0_RTCCALICFG1_REG,  0x6001F06C
.equ TIMG0_RTCCALICFG2_REG,  0x6001F080
# Interrupt registers
.equ TIMG0_INT_ENA_TIMERS_REG, 0x6001F070
.equ TIMG0_INT_RAW_TIMERS_REG, 0x6001F074
.equ TIMG0_INT_ST_TIMERS_REG,  0x6001F078
.equ TIMG0_INT_CLR_TIMERS_REG, 0x6001F07C
# Version register
.equ TIMG0_NTIMERS_DATE_REG,   0x6001F0F8
# Clock configuration registers
.equ TIMG0_REGCLK_REG,         0x6001F0FC
######################################################

######################################################
# Timer Group (TIMG)
# (TRM 286) (timer group 1)
# (note: inserted a 1 to the register names)
######################################################
.equ TIMG1_BASE,                  0x60020000
# T0 control and configuration registers
.equ TIMG1_T0CONFIG_REG,          0x60020000
.equ TIMG1_T0LO_REG,              0x60020004
.equ TIMG1_T0HI_REG,              0x60020008
.equ TIMG1_T0UPDATE_REG,          0x6002000C
.equ TIMG1_T0ALARMLO_REG,         0x60020010
.equ TIMG1_T0ALARMHI_REG,         0x60020014
.equ TIMG1_T0LOADLO_REG,          0x60020018
.equ TIMG1_T0LOADHI_REG,          0x6002001C
.equ TIMG1_T0LOAD_REG,            0x60020020
# WDT control and configuration registers
.equ TIMG1_WDTCONFIG0_REG,        0x60020048
.equ TIMG1_WDTCONFIG1_REG,        0x6002004C
.equ TIMG1_WDTCONFIG2_REG,        0x60020050
.equ TIMG1_WDTCONFIG3_REG,        0x60020054
.equ TIMG1_WDTCONFIG4_REG,        0x60020058
.equ TIMG1_WDTCONFIG5_REG,        0x6002005C
.equ TIMG1_WDTFEED_REG,           0x60020060
.equ TIMG1_WDTWPROTECT_REG,       0x60020064
# RTC frequency calculation control and configuration registers
.equ TIMG1_RTCCALICFG_REG,        0x60020068
.equ TIMG1_RTCCALICFG1_REG,       0x6002006C
.equ TIMG1_RTCCALICFG2_REG,       0x60020080
# Interrupt registers
.equ TIMG1_INT_ENA_TIMERS_REG,    0x60020070
.equ TIMG1_INT_RAW_TIMERS_REG,    0x60020074
.equ TIMG1_INT_ST_TIMERS_REG,     0x60020078
.equ TIMG1_INT_CLR_TIMERS_REG,    0x6002007C
# Version register
.equ TIMG1_NTIMERS_DATE_REG,      0x600200F8
# Clock configuration registers
.equ TIMG1_REGCLK_REG,            0x600200FC
######################################################

######################################################
# Permission Control (PMS)
# (TRM 325)
######################################################
.equ PMS_BASE,                                     0x600C1000
# Configuration Register
.equ PMS_PRIVILEGE_MODE_SEL_LOCK_REG,              0x600C1008
.equ PMS_PRIVILEGE_MODE_SEL_REG,                   0x600C100C
.equ PMS_APB_PERIPHERAL_ACCESS_0_REG,              0x600C1010
.equ PMS_APB_PERIPHERAL_ACCESS_1_REG,              0x600C1014
.equ PMS_INTERNAL_SRAM_USAGE_0_REG,                0x600C1018
.equ PMS_INTERNAL_SRAM_USAGE_1_REG,                0x600C101C
.equ PMS_INTERNAL_SRAM_USAGE_4_REG,                0x600C1024
.equ PMS_DMA_APBPERI_SPI2_PMS_CONSTRAIN_0_REG,     0x600C1038
.equ PMS_DMA_APBPERI_SPI2_PMS_CONSTRAIN_1_REG,     0x600C103C
.equ PMS_DMA_APBPERI_UCHI0_PMS_CONSTRAIN_0_REG,    0x600C1040
.equ PMS_DMA_APBPERI_UCHI0_PMS_CONSTRAIN_1_REG,    0x600C1044
.equ PMS_DMA_APBPERI_I2S0_PMS_CONSTRAIN_0_REG,     0x600C1048
.equ PMS_DMA_APBPERI_I2S0_PMS_CONSTRAIN_1_REG,     0x600C104C
.equ PMS_DMA_APBPERI_AES_PMS_CONSTRAIN_0_REG,      0x600C1068
.equ PMS_DMA_APBPERI_AES_PMS_CONSTRAIN_1_REG,      0x600C106C
.equ PMS_DMA_APBPERI_SHA_PMS_CONSTRAIN_0_REG,      0x600C1070
.equ PMS_DMA_APBPERI_SHA_PMS_CONSTRAIN_1_REG,      0x600C1074
.equ PMS_DMA_APBPERI_ADC_DAC_PMS_CONSTRAIN_0_REG,  0x600C1078
.equ PMS_DMA_APBPERI_ADC_DAC_PMS_CONSTRAIN_1_REG,  0x600C107C
.equ PMS_DMA_APBPERI_PMS_MONITOR_0_REG,            0x600C1080
.equ PMS_DMA_APBPERI_PMS_MONITOR_1_REG,            0x600C1084
.equ PMS_CORE_X_IRAM0_DRAM0_DMA_SPLIT_LINE_CONSTRAIN_0_REG, 0x600C1090
.equ PMS_CORE_X_IRAM0_DRAM0_DMA_SPLIT_LINE_CONSTRAIN_1_REG, 0x600C1094
.equ PMS_CORE_X_IRAM0_DRAM0_DMA_SPLIT_LINE_CONSTRAIN_2_REG, 0x600C1098
.equ PMS_CORE_X_IRAM0_DRAM0_DMA_SPLIT_LINE_CONSTRAIN_3_REG, 0x600C109C
.equ PMS_CORE_X_IRAM0_DRAM0_DMA_SPLIT_LINE_CONSTRAIN_4_REG, 0x600C10A0
.equ PMS_CORE_X_IRAM0_DRAM0_DMA_SPLIT_LINE_CONSTRAIN_5_REG, 0x600C10A4
.equ PMS_CORE_X_IRAM0_PMS_CONSTRAIN_0_REG,         0x600C10A8
.equ PMS_CORE_X_IRAM0_PMS_CONSTRAIN_1_REG,         0x600C10AC
.equ PMS_CORE_X_IRAM0_PMS_CONSTRAIN_2_REG,         0x600C10B0
.equ PMS_CORE_0_IRAM0_PMS_MONITOR_0_REG,           0x600C10B4
.equ PMS_CORE_0_IRAM0_PMS_MONITOR_1_REG,           0x600C10B8
.equ PMS_CORE_X_DRAM0_PMS_CONSTRAIN_0_REG,         0x600C10C0
.equ PMS_CORE_X_DRAM0_PMS_CONSTRAIN_1_REG,         0x600C10C4
.equ PMS_CORE_0_DRAM0_PMS_MONITOR_0_REG,           0x600C10C8
.equ PMS_CORE_0_DRAM0_PMS_MONITOR_1_REG,           0x600C10CC
.equ PMS_CORE_0_PIF_PMS_CONSTRAIN_0_REG,           0x600C10D8
.equ PMS_CORE_0_PIF_PMS_CONSTRAIN_1_REG,           0x600C10DC
.equ PMS_CORE_0_PIF_PMS_CONSTRAIN_2_REG,           0x600C10E0
.equ PMS_CORE_0_PIF_PMS_CONSTRAIN_3_REG,           0x600C10E4
.equ PMS_CORE_0_PIF_PMS_CONSTRAIN_4_REG,           0x600C10E8
.equ PMS_CORE_0_PIF_PMS_CONSTRAIN_5_REG,           0x600C10EC
.equ PMS_CORE_0_PIF_PMS_CONSTRAIN_6_REG,           0x600C10F0
.equ PMS_CORE_0_PIF_PMS_CONSTRAIN_7_REG,           0x600C10F4
.equ PMS_CORE_0_PIF_PMS_CONSTRAIN_8_REG,           0x600C10F8
.equ PMS_CORE_0_PIF_PMS_CONSTRAIN_9_REG,           0x600C10FC
.equ PMS_CORE_0_PIF_PMS_CONSTRAIN_10_REG,          0x600C1100
.equ PMS_REGION_PMS_CONSTRAIN_0_REG,               0x600C1104
.equ PMS_REGION_PMS_CONSTRAIN_1_REG,               0x600C1108
.equ PMS_REGION_PMS_CONSTRAIN_2_REG,               0x600C110C
.equ PMS_REGION_PMS_CONSTRAIN_3_REG,               0x600C1110
.equ PMS_REGION_PMS_CONSTRAIN_4_REG,               0x600C1114
.equ PMS_REGION_PMS_CONSTRAIN_5_REG,               0x600C1118
.equ PMS_REGION_PMS_CONSTRAIN_6_REG,               0x600C111C
.equ PMS_REGION_PMS_CONSTRAIN_7_REG,               0x600C1120
.equ PMS_REGION_PMS_CONSTRAIN_8_REG,               0x600C1124
.equ PMS_REGION_PMS_CONSTRAIN_9_REG,               0x600C1128
.equ PMS_REGION_PMS_CONSTRAIN_10_REG,              0x600C112C
.equ PMS_CORE_0_PIF_PMS_MONITOR_0_REG,             0x600C1130
.equ PMS_CORE_0_PIF_PMS_MONITOR_1_REG,             0x600C1134
.equ PMS_CORE_0_PIF_PMS_MONITOR_4_REG,             0x600C1140
# Status Register
.equ PMS_DMA_APBPERI_PMS_MONITOR_2_REG,            0x600C1088
.equ PMS_DMA_APBPERI_PMS_MONITOR_3_REG,            0x600C108C
.equ PMS_CORE_0_IRAM0_PMS_MONITOR_2_REG,           0x600C10BC
.equ PMS_CORE_0_DRAM0_PMS_MONITOR_2_REG,           0x600C10D0
.equ PMS_CORE_0_DRAM0_PMS_MONITOR_3_REG,           0x600C10D4
.equ PMS_CORE_0_PIF_PMS_MONITOR_2_REG,             0x600C1138
.equ PMS_CORE_0_PIF_PMS_MONITOR_3_REG,             0x600C113C
.equ PMS_CORE_0_PIF_PMS_MONITOR_5_REG,             0x600C1144
.equ PMS_CORE_0_PIF_PMS_MONITOR_6_REG,             0x600C1148
# Version Register
.equ PMS_CLOCK_GATE_REG_REG,                       0x600C1170
.equ PMS_DATE_REG,                                 0x600C1FFC
# Configuration Registers
.equ SYSCON_EXT_MEM_PMS_LOCK_REG,                  0x600C1220
.equ SYSCON_FLASH_ACE0_ATTR_REG,                   0x600C1028
.equ SYSCON_FLASH_ACE1_ATTR_REG,                   0x600C102C
.equ SYSCON_FLASH_ACE2_ATTR_REG,                   0x600C1030
.equ SYSCON_FLASH_ACE3_ATTR_REG,                   0x600C1034
.equ SYSCON_SRAM_ACE0_ADDR_S,                      0x600C1038
.equ SYSCON_SRAM_ACE1_ADDR_S,                      0x600C103C
.equ SYSCON_SRAM_ACE2_ADDR_S,                      0x600C1040
.equ SYSCON_SRAM_ACE3_ADDR_S,                      0x600C1044
.equ SYSCON_FLASH_ACE0_SIZE_REG,                   0x600C1048
.equ SYSCON_FLASH_ACE1_SIZE_REG,                   0x600C104C
.equ SYSCON_FLASH_ACE2_SIZE_REG,                   0x600C1050
.equ SYSCON_FLASH_ACE3_SIZE_REG,                   0x600C1054
.equ SYSCON_SPI_MEM_PMS_CTRL_REG,                  0x600C1088
.equ SYSCON_SPI_MEM_REJECT_ADDR_REG,               0x600C108C
# Permission Configure register
.equ EXTMEM_IBUS_PMS_TBL_LOCK_REG,                 0x600C10D8
.equ EXTMEM_IBUS_PMS_TBL_BOUNDARY0_REG,            0x600C10DC
.equ EXTMEM_IBUS_PMS_TBL_BOUNDARY1_REG,            0x600C10E0
.equ EXTMEM_IBUS_PMS_TBL_BOUNDARY2_REG,            0x600C10E4
.equ EXTMEM_IBUS_PMS_TBL_ATTR_REG,                 0x600C10E8
.equ EXTMEM_DBUS_PMS_TBL_LOCK_REG,                 0x600C10EC
.equ EXTMEM_DBUS_PMS_TBL_BOUNDARY0_REG,            0x600C10F0
.equ EXTMEM_DBUS_PMS_TBL_BOUNDARY1_REG,            0x600C10F4
.equ EXTMEM_DBUS_PMS_TBL_BOUNDARY2_REG,            0x600C10F8
.equ EXTMEM_DBUS_PMS_TBL_ATTR_REG,                 0x600C10FC
######################################################

######################################################
# World Controller (WCL) Registers (WCL)
# (TRM 412)
######################################################
.equ WCL_BASE,                           0x600D0000
# WORLD1 to WORLD0 Configuration Registers
.equ WCL_Core_0_MTVEC_BASE_REG,          0x600D0000   
.equ WCL_Core_0_MSTATUS_MIE_REG,         0x600D0004
.equ WCL_Core_0_ENTRY_CHECK_REG,         0x600D0008
# StatusTable Registers
.equ WCL_Core_0_STATUSTABLE0_REG,        0x600D0040
.equ WCL_Core_0_STATUSTABLE1_REG,        0x600D0044
.equ WCL_Core_0_STATUSTABLE2_REG,        0x600D0048
.equ WCL_Core_0_STATUSTABLE3_REG,        0x600D004C
.equ WCL_Core_0_STATUSTABLE4_REG,        0x600D0050
.equ WCL_Core_0_STATUSTABLE5_REG,        0x600D0054
.equ WCL_Core_0_STATUSTABLE6_REG,        0x600D0058
.equ WCL_Core_0_STATUSTABLE7_REG,        0x600D005C
.equ WCL_Core_0_STATUSTABLE8_REG,        0x600D0060
.equ WCL_Core_0_STATUSTABLE9_REG,        0x600D0064
.equ WCL_Core_0_STATUSTABLE10_REG,       0x600D0068
.equ WCL_Core_0_STATUSTABLE11_REG,       0x600D006C
.equ WCL_Core_0_STATUSTABLE12_REG,       0x600D0070
.equ WCL_Core_0_STATUSTABLE13_REG,       0x600D0074
.equ WCL_Core_0_STATUSTABLE14_REG,       0x600D0078
.equ WCL_Core_0_STATUSTABLE15_REG,       0x600D007C
.equ WCL_Core_0_STATUSTABLE16_REG,       0x600D0080
.equ WCL_Core_0_STATUSTABLE17_REG,       0x600D0084
.equ WCL_Core_0_STATUSTABLE18_REG,       0x600D0088
.equ WCL_Core_0_STATUSTABLE19_REG,       0x600D008C
.equ WCL_Core_0_STATUSTABLE20_REG,       0x600D0090
.equ WCL_Core_0_STATUSTABLE21_REG,       0x600D0094
.equ WCL_Core_0_STATUSTABLE22_REG,       0x600D0098
.equ WCL_Core_0_STATUSTABLE23_REG,       0x600D009C
.equ WCL_Core_0_STATUSTABLE24_REG,       0x600D00A0
.equ WCL_Core_0_STATUSTABLE25_REG,       0x600D00A4
.equ WCL_Core_0_STATUSTABLE26_REG,       0x600D00A8
.equ WCL_Core_0_STATUSTABLE27_REG,       0x600D00AC
.equ WCL_Core_0_STATUSTABLE28_REG,       0x600D00B0
.equ WCL_Core_0_STATUSTABLE29_REG,       0x600D00B4
.equ WCL_Core_0_STATUSTABLE30_REG,       0x600D00B8
.equ WCL_Core_0_STATUSTABLE31_REG,       0x600D00BC
.equ WCL_Core_0_STATUSTABLE_CURRENT_REG, 0x600D00E0
# WORLD0 to WORLD1 Configuration Registers
.equ WCL_Core_0_World_TRIGGER_ADDR_REG,  0x600D0140
.equ WCL_Core_0_World_PREPARE_REG,       0x600D0144
.equ WCL_Core_0_World_UPDATE_REG,        0x600D0148
.equ WCL_Core_0_World_Cancel_REG,        0x600D014C
.equ WCL_Core_0_World_IRam0_REG,         0x600D0150
.equ WCL_Core_0_World_DRam0_PIF_REG,     0x600D0154
.equ WCL_Core_0_World_Phase_REG,         0x600D0158
######################################################

