codeljo/riscv-bare-metal/esp32c3/include/registers.inc
######################################################
# System Registers (SYSREG)
# (TRM 421)
######################################################
.equ SYSTEM_BASE,                        0x600C0000
# Peripheral Clock Control Registers
.equ SYSTEM_CPU_PERI_CLK_EN_REG,         0x600C0000
.equ SYSTEM_CPU_PERI_RST_EN_REG,         0x600C0004
.equ SYSTEM_PERIP_CLK_EN0_REG,           0x600C0010
.equ SYSTEM_PERIP_CLK_EN1_REG,           0x600C0014
.equ SYSTEM_PERIP_RST_EN0_REG,           0x600C0018
.equ SYSTEM_PERIP_RST_EN1_REG,           0x600C001C
.equ SYSTEM_CACHE_CONTROL_REG,           0x600C0040
#  Clock Configuration Registers
.equ SYSTEM_CPU_PER_CONF_REG,            0x600C0008
.equ SYSTEM_SYSCLK_CONF_REG,             0x600C0058
# Low-power Management Registers
.equ SYSTEM_BT_LPCK_DIV_FRAC_REG,        0x600C0024
.equ SYSTEM_RTC_FASTMEM_CONFIG_REG,      0x600C0048
.equ SYSTEM_RTC_FASTMEM_CRC_REG,         0x600C004C
# CPU Interrupt Control Registers
.equ SYSTEM_CPU_INTR_FROM_CPU_0_REG,     0x600C0028
.equ SYSTEM_CPU_INTR_FROM_CPU_1_REG,     0x600C002C
.equ SYSTEM_CPU_INTR_FROM_CPU_2_REG,     0x600C0030
.equ SYSTEM_CPU_INTR_FROM_CPU_3_REG,     0x600C0034
# System and Memory Control Registers
.equ SYSTEM_RSA_PD_CTRL_REG,             0x600C0038
.equ SYSTEM_EXTERNAL_DEVICE_ENCRYPT_DECRYPT_CONTROL_REG, 0x600C0044
# Clock Gate Control Register
.equ SYSTEM_CLOCK_GATE_REG,              0x600C0054
# Date Register
.equ SYSTEM_DATE_REG,                    0x600C0FFc

# The addresses below are relative to the base address of apb control
# base address is SYSCON (0x60026000)
.equ SYSCON_CLKGATE_FORCE_ON_REG,        0x600260A4
.equ SYSCON_MEM_POWER_DOWN_REG,          0x600260A8
.equ SYSCON_MEM_POWER_UP_REG,            0x600260AC
######################################################

######################################################
# Debug Assistant (ASSIST_DEBUG)
# (TRM 442)
######################################################
.equ ASSIST_DEBUG_BASE,                          0x600CE000
# Monitor configuration registers
.equ ASSIST_DEBUG_CORE_0_MONTR_ENA_REG,          0x600CE000
.equ ASSIST_DEBUG_CORE_0_AREA_DRAM0_0_MIN_REG,   0x600CE010
.equ ASSIST_DEBUG_CORE_0_AREA_DRAM0_0_MAX_REG,   0x600CE014
.equ ASSIST_DEBUG_CORE_0_AREA_DRAM0_1_MIN_REG,   0x600CE018
.equ ASSIST_DEBUG_CORE_0_AREA_DRAM0_1_MAX_REG,   0x600CE01C
.equ ASSIST_DEBUG_CORE_0_AREA_PIF_0_MIN_REG,     0x600CE020
.equ ASSIST_DEBUG_CORE_0_AREA_PIF_0_MAX_REG,     0x600CE024
.equ ASSIST_DEBUG_CORE_0_AREA_PIF_1_MIN_REG,     0x600CE028
.equ ASSIST_DEBUG_CORE_0_AREA_PIF_1_MAX_REG,     0x600CE02C
.equ ASSIST_DEBUG_CORE_0_AREA_PC_REG,            0x600CE030
.equ ASSIST_DEBUG_CORE_0_AREA_SP_REG,            0x600CE034
.equ ASSIST_DEBUG_CORE_0_SP_MIN_REG,             0x600CE038
.equ ASSIST_DEBUG_CORE_0_SP_MAX_REG,             0x600CE03C
.equ ASSIST_DEBUG_CORE_0_SP_PC_REG,              0x600CE040
# Interrupt configuration registers
.equ ASSIST_DEBUG_CORE_0_INTR_RAW_REG,           0x600CE004
.equ ASSIST_DEBUG_CORE_0_INTR_ENA_REG,           0x600CE008
.equ ASSIST_DEBUG_CORE_0_INTR_CLR_REG,           0x600CE00C
# PC logging configuration register
.equ ASSIST_DEBUG_CORE_0_RCD_EN_REG,             0x600CE044
# PC logging status registers
.equ ASSIST_DEBUG_CORE_0_RCD_PDEBUGPC_REG,       0x600CE048
.equ ASSIST_DEBUG_CORE_0_RCD_PDEBUGSP_REG,       0x600CE04C
# Bus access logging configuration registers
.equ ASSIST_DEBUG_LOG_SETTING_REG,               0x600CE070
.equ ASSIST_DEBUG_LOG_DATA_0_REG,                0x600CE074
.equ ASSIST_DEBUG_LOG_DATA_MASK_REG,             0x600CE078
.equ ASSIST_DEBUG_LOG_MIN_REG,                   0x600CE07C
.equ ASSIST_DEBUG_LOG_MAX_REG,                   0x600CE080
.equ ASSIST_DEBUG_LOG_MEM_START_REG,             0x600CE084
.equ ASSIST_DEBUG_LOG_MEM_END_REG,               0x600CE088
.equ ASSIST_DEBUG_LOG_MEM_CURRENT_ADDR_REG,      0x600CE08C
.equ ASSIST_DEBUG_LOG_MEM_FULL_FLAG_REG,         0x600CE090
# CPU Status Registers
.equ ASSIST_DEBUG_CORE_0_LASTPC_BEFORE_EXCEPTION_REG, 0x600CE094
.equ ASSIST_DEBUG_CORE_0_DEBUG_MODE_REG,         0x600CE098
# Version Register
.equ ASSIST_DEBUG_DATE_REG,                      0x600CE1FC
######################################################

######################################################
# SHA Accelerator (SHA)
# (TRM 464)
######################################################
.equ SHA_BASE, 0x6003B000
# Control/Status registers
.equ SHA_CONTINUE_REG,         0x6003B014
.equ SHA_BUSY_REG,             0x6003B018
.equ SHA_DMA_START_REG,        0x6003B01C
.equ SHA_START_REG,            0x6003B010
.equ SHA_DMA_CONTINUE_REG,     0x6003B020
.equ SHA_INT_CLEAR_REG,        0x6003B024
.equ SHA_INT_ENA_REG,          0x6003B028
# Versoin Register
.equ SHA_DATE_REG,             0x6003B02C
# Configuration Registers
.equ SHA_MODE_REG,             0x6003B000
# Data Registers
.equ SHA_DMA_BLOCK_NUM_REG,    0x6003B00C
.equ SHA_H_0_REG,              0x6003B040
.equ SHA_H_1_REG,              0x6003B044
.equ SHA_H_2_REG,              0x6003B048
.equ SHA_H_3_REG,              0x6003B04C
.equ SHA_H_4_REG,              0x6003B050
.equ SHA_H_5_REG,              0x6003B054
.equ SHA_H_6_REG,              0x6003B058
.equ SHA_H_7_REG,              0x6003B05C
.equ SHA_M_0_REG,              0x6003B080
.equ SHA_M_1_REG,              0x6003B084
.equ SHA_M_2_REG,              0x6003B088
.equ SHA_M_3_REG,              0x6003B08C
.equ SHA_M_4_REG,              0x6003B090
.equ SHA_M_5_REG,              0x6003B094
.equ SHA_M_6_REG,              0x6003B098
.equ SHA_M_7_REG,              0x6003B09C
.equ SHA_M_8_REG,              0x6003B0A0
.equ SHA_M_9_REG,              0x6003B0A4
.equ SHA_M_10_REG,             0x6003B0A8
.equ SHA_M_11_REG,             0x6003B0AC
.equ SHA_M_12_REG,             0x6003B0B0
.equ SHA_M_13_REG,             0x6003B0B4
.equ SHA_M_14_REG,             0x6003B0B8
.equ SHA_M_15_REG,             0x6003B0BC
######################################################

######################################################
# AES Accelerator (AES)
# (TRM 478)
######################################################
.equ AES_BASE, 0x6003A000
# Key Registers
.equ AES_KEY_0_REG,           0x6003A000
.equ AES_KEY_1_REG,           0x6003A004
.equ AES_KEY_2_REG,           0x6003A008
.equ AES_KEY_3_REG,           0x6003A00C
.equ AES_KEY_4_REG,           0x6003A010
.equ AES_KEY_5_REG,           0x6003A014
.equ AES_KEY_6_REG,           0x6003A018
.equ AES_KEY_7_REG,           0x6003A01C
# TEXT_IN Registers
.equ AES_TEXT_IN_0_REG,       0x6003A020
.equ AES_TEXT_IN_1_REG,       0x6003A024
.equ AES_TEXT_IN_2_REG,       0x6003A028
.equ AES_TEXT_IN_3_REG,       0x6003A02C
# TEXT_OUT Registers
.equ AES_TEXT_OUT_0_REG,      0x6003A030
.equ AES_TEXT_OUT_1_REG,      0x6003A034
.equ AES_TEXT_OUT_2_REG,      0x6003A038
.equ AES_TEXT_OUT_3_REG,      0x6003A03C
# Configuration Registers
.equ AES_MODE_REG,            0x6003A040
.equ AES_DMA_ENABLE_REG,      0x6003A090
.equ AES_BLOCK_MODE_REG,      0x6003A094
.equ AES_BLOCK_NUM_REG,       0x6003A098
.equ AES_INC_SEL_REG,         0x6003A09C
# Controlling / Status Registers 
.equ AES_TRIGGER_REG,         0x6003A048
.equ AES_STATE_REG,           0x6003A04C
.equ AES_DMA_EXIT_REG,        0x6003A0B8
# Interrupt Registers
.equ AES_INT_CLR_REG,         0x6003A0AC
.equ AES_INT_ENA_REG,         0x6003A0B0
######################################################

######################################################
# RSA Accelerator (RSA)
# (TRM 489)
######################################################
.equ RSA_BASE,                0x6003C000
# Configuration Registers
.equ RSA_M_PRIME_REG,         0x6003C800
.equ RSA_MODE_REG,            0x6003C804
.equ RSA_CONSTANT_TIME_REG,   0x6003C820
.equ RSA_SEARCH_ENABLE_REG,   0x6003C824
.equ RSA_SEARCH_POS_REG,      0x6003C828
# Status/Control Registers
.equ RSA_CLEAN_REG,           0x6003C808
.equ RSA_MODEXP_START_REG,    0x6003C80C
.equ RSA_MODMULT_START_REG,   0x6003C810
.equ RSA_MULT_START_REG,      0x6003C814
.equ RSA_IDLE_REG,            0x6003C818
# Interrupt Registers
.equ RSA_CLEAR_INTERRUPT_REG, 0x6003C81C
.equ RSA_INTERRUPT_ENA_REG,   0x6003C82C
# Version Register
.equ RSA_DATE_REG,            0x6003C830
######################################################

######################################################
# HMAC Accelerator (HMAC)
# (TRM 501)
######################################################
.equ HMAC_BASE,                     0x6003E000
# Control/Status Registers
.equ HMAC_SET_START_REG,            0x6003E040
.equ HMAC_SET_PARA_FINISH_REG,      0x6003E04C
.equ HMAC_SET_MESSAGE_ONE_REG,      0x6003E050
.equ HMAC_SET_MESSAGE_ING_REG,      0x6003E054
.equ HMAC_SET_MESSAGE_END_REG,      0x6003E058
.equ HMAC_SET_RESULT_FINISH_REG,    0x6003E05C
.equ HMAC_SET_INVALIDATE_JTAG_REG,  0x6003E060
.equ HMAC_SET_INVALIDATE_DS_REG,    0x6003E064
.equ HMAC_QUERY_ERROR_REG,          0x6003E06C
# Configuration Registers
.equ HMAC_SET_PARA_PURPOSE_REG,     0x6003E044
.equ HMAC_SET_PARA_KEY_REG,         0x6003E048
.equ HMAC_SOFT_JTAG_CTRL_REG,       0x6003E0F8
.equ HMAC_WR_JTAG_REG,              0x6003E0FC
# HMAC Message Block
.equ HMAC_WR_MESSAGE_0_REG,         0x6003E080
.equ HMAC_WR_MESSAGE_1_REG,         0x6003E084
.equ HMAC_WR_MESSAGE_2_REG,         0x6003E088
.equ HMAC_WR_MESSAGE_3_REG,         0x6003E08C
.equ HMAC_WR_MESSAGE_4_REG,         0x6003E090
.equ HMAC_WR_MESSAGE_5_REG,         0x6003E094
.equ HMAC_WR_MESSAGE_6_REG,         0x6003E098
.equ HMAC_WR_MESSAGE_7_REG,         0x6003E09C
.equ HMAC_WR_MESSAGE_8_REG,         0x6003E0A0
.equ HMAC_WR_MESSAGE_9_REG,         0x6003E0A4
.equ HMAC_WR_MESSAGE_10_REG,        0x6003E0A8
.equ HMAC_WR_MESSAGE_11_REG,        0x6003E0AC
.equ HMAC_WR_MESSAGE_12_REG,        0x6003E0B0
.equ HMAC_WR_MESSAGE_13_REG,        0x6003E0B4
.equ HMAC_WR_MESSAGE_14_REG,        0x6003E0B8
.equ HMAC_WR_MESSAGE_15_REG,        0x6003E0BC
# HMAC Upstream Result
.equ HMAC_RD_RESULT_0_REG,          0x6003E0C0
.equ HMAC_RD_RESULT_1_REG,          0x6003E0C4
.equ HMAC_RD_RESULT_2_REG,          0x6003E0C8
.equ HMAC_RD_RESULT_3_REG,          0x6003E0CC
.equ HMAC_RD_RESULT_4_REG,          0x6003E0D0
.equ HMAC_RD_RESULT_5_REG,          0x6003E0D4
.equ HMAC_RD_RESULT_6_REG,          0x6003E0D8
.equ HMAC_RD_RESULT_7_REG,          0x6003E0DC
.equ HMAC_SET_MESSAGE_PAD_REG,      0x6003E0F0
.equ HMAC_ONE_BLOCK_REG,            0x6003E0F4
.equ HMAC_DATE_REG,                 0x6003E0F8
######################################################

######################################################
# Digital Signature (DS)
# (TRM 515)
######################################################
.equ DS_BASE,                 0x6003D000
# Configuration Registers
.equ DS_IV_0_REG,             0x6003D630
.equ DS_IV_1_REG,             0x6003D634
.equ DS_IV_2_REG,             0x6003D638
.equ DS_IV_3_REG,             0x6003D63C
# Status/Control Registers
.equ DS_SET_START_REG,        0x6003DE00
.equ DS_SET_ME_REG,           0x6003DE04
.equ DS_SET_FINISH_REG,       0x6003DE08
.equ DS_QUERY_BUSY_REG,       0x6003DE0C
.equ DS_QUERY_KEY_WRONG_REG,  0x6003DE10
.equ DS_QUERY_CHECK_REG,      0x6003D814
# Version Control Register
.equ DS_DATE_REG,             0x6003D820
######################################################

######################################################
# External Memory Encryption and Decryption (XTS_AES)
# (TRM 523)
######################################################
.equ XTS_AES_BASE,            0x600CC000
# Plaintext Register Heap
.equ XTS_AES_PLAIN_0_REG,     0x600CC000
.equ XTS_AES_PLAIN_1_REG,     0x600CC004
.equ XTS_AES_PLAIN_2_REG,     0x600CC008
.equ XTS_AES_PLAIN_3_REG,     0x600CC00C
.equ XTS_AES_PLAIN_4_REG,     0x600CC010
.equ XTS_AES_PLAIN_5_REG,     0x600CC014
.equ XTS_AES_PLAIN_6_REG,     0x600CC018
.equ XTS_AES_PLAIN_7_REG,     0x600CC01C
# Configuration Registers
.equ XTS_AES_LINESIZE_REG,    0x600CC040
.equ XTS_AES_DESTINATION_REG, 0x600CC044
.equ XTS_AES_PHYSICAL_ADDRESS_REG, 0x600CC048
# Control/Status Registers
.equ XTS_AES_TRIGGER_REG,     0x600CC04C
.equ XTS_AES_RELEASE_REG,     0x600CC050
.equ XTS_AES_DESTROY_REG,     0x600CC054
.equ XTS_AES_STATE_REG,       0x600CC058
# Version Register
.equ XTS_AES_DATE_REG,        0x600CC05C
######################################################

######################################################
# Random Number Generator (RNG)
# (TRM 529)
######################################################
.equ RNG_DATA_REG, 0x600260B0
######################################################

######################################################
# UART Controller (UART)
# (TRM 550)
######################################################
.equ UART0_BASE,               0x60000000
.equ UART1_BASE,               0x60010000

