codeljo/riscv-bare-metal/esp32c3/include/registers.inc
# UART0
# FIFO Configuration
.equ UART0_FIFO_REG,           0x60000000
.equ UART0_MEM_CONF_REG,       0x60000060
# UART Interrupt Register
.equ UART0_INT_RAW_REG,        0x60000004
.equ UART0_INT_ST_REG,         0x60000008
.equ UART0_INT_ENA_REG,        0x6000000C
.equ UART0_INT_CLR_REG,        0x60000010
# Configuration Register
.equ UART0_CLKDIV_REG,         0x60000014
.equ UART0_RX_FILT_REG,        0x60000018
.equ UART0_CONF0_REG,          0x60000020
.equ UART0_CONF1_REG,          0x60000024
.equ UART0_FLOW_CONF_REG,      0x60000034
.equ UART0_SLEEP_CONF_REG,     0x60000038
.equ UART0_SWFC_CONF0_REG,     0x6000003C
.equ UART0_SWFC_CONF1_REG,     0x60000040
.equ UART0_TXBRK_CONF_REG,     0x60000044
.equ UART0_IDLE_CONF_REG,      0x60000048
.equ UART0_RS485_CONF_REG,     0x6000004C
.equ UART0_CLK_CONF_REG,       0x60000078
# Status Register
.equ UART0_STATUS_REG,         0x6000001C
.equ UART0_MEM_TX_STATUS_REG,  0x60000064
.equ UART0_MEM_RX_STATUS_REG,  0x60000068
.equ UART0_FSM_STATUS_REG,     0x6000006C
# Autobaud Register
.equ UART0_LOWPULSE_REG,       0x60000028 
.equ UART0_HIGHPULSE_REG,      0x6000002C
.equ UART0_RXD_CNT_REG,        0x60000030
.equ UART0_POSPULSE_REG,       0x60000070
.equ UART0_NEGPULSE_REG,       0x60000074
# AT Escape Sequence Selection Configuration
.equ UART0_AT_CMD_PRECNT_REG,  0x60000050
.equ UART0_AT_CMD_POSTCNT_REG, 0x60000054
.equ UART0_AT_CMD_GAPTOUT_REG, 0x60000058
.equ UART0_AT_CMD_CHAR_REG,    0x6000005C
# Version Register
.equ UART0_DATE_REG,           0x6000007C
.equ UART0_ID_REG,             0x60000080

# UART1
# FIFO Configuration
.equ UART1_FIFO_REG,           0x60010000
.equ UART1_MEM_CONF_REG,       0x60010060
# UART Interrupt Register
.equ UART1_INT_RAW_REG,        0x60010004
.equ UART1_INT_ST_REG,         0x60010008
.equ UART1_INT_ENA_REG,        0x6001000C
.equ UART1_INT_CLR_REG,        0x60010010
# Configuration Register
.equ UART1_CLKDIV_REG,         0x60010014
.equ UART1_RX_FILT_REG,        0x60010018
.equ UART1_CONF0_REG,          0x60010020
.equ UART1_CONF1_REG,          0x60010024
.equ UART1_FLOW_CONF_REG,      0x60010034
.equ UART1_SLEEP_CONF_REG,     0x60010038
.equ UART1_SWFC_CONF0_REG,     0x6001003C
.equ UART1_SWFC_CONF1_REG,     0x60010040
.equ UART1_TXBRK_CONF_REG,     0x60010044
.equ UART1_IDLE_CONF_REG,      0x60010048
.equ UART1_RS485_CONF_REG,     0x6001004C
.equ UART1_CLK_CONF_REG,       0x60010078
# Status Register
.equ UART1_STATUS_REG,         0x6001001C
.equ UART1_MEM_TX_STATUS_REG,  0x60010064
.equ UART1_MEM_RX_STATUS_REG,  0x60010068
.equ UART1_FSM_STATUS_REG,     0x6001006C
# Autobaud Register
.equ UART1_LOWPULSE_REG,       0x60010028 
.equ UART1_HIGHPULSE_REG,      0x6001002C
.equ UART1_RXD_CNT_REG,        0x60010030
.equ UART1_POSPULSE_REG,       0x60010070
.equ UART1_NEGPULSE_REG,       0x60010074
# AT Escape Sequence Selection Configuration
.equ UART1_AT_CMD_PRECNT_REG,  0x60010050
.equ UART1_AT_CMD_POSTCNT_REG, 0x60010054
.equ UART1_AT_CMD_GAPTOUT_REG, 0x60010058
.equ UART1_AT_CMD_CHAR_REG,    0x6001005C
# Version Register
.equ UART1_DATE_REG,           0x6001007C
.equ UART1_ID_REG,             0x60010080

# UHCI0
.equ UHCI0_BASE,               0x60014000
# Configuration Register
.equ UHCI_CONF0_REG,           0x60014000     
.equ UHCI_CONF1_REG,           0x60014014
.equ UHCI_ESCAPE_CONF_REG,     0x60014020
.equ UHCI_HUNG_CONF_REG,       0x60014024
.equ UHCI_ACK_NUM_REG,         0x60014028
.equ UHCI_QUICK_SENT_REG,      0x60014030
.equ UHCI_REG_Q0_WORD0_REG,    0x60014034
.equ UHCI_REG_Q0_WORD1_REG,    0x60014038
.equ UHCI_REG_Q1_WORD0_REG,    0x6001403C
.equ UHCI_REG_Q1_WORD1_REG,    0x60014040
.equ UHCI_REG_Q2_WORD0_REG,    0x60014044
.equ UHCI_REG_Q2_WORD1_REG,    0x60014048
.equ UHCI_REG_Q3_WORD0_REG,    0x6001404C
.equ UHCI_REG_Q3_WORD1_REG,    0x60014050
.equ UHCI_REG_Q4_WORD0_REG,    0x60014054
.equ UHCI_REG_Q4_WORD1_REG,    0x60014058
.equ UHCI_REG_Q5_WORD0_REG,    0x6001405C
.equ UHCI_REG_Q5_WORD1_REG,    0x60014060
.equ UHCI_REG_Q6_WORD0_REG,    0x60014064
.equ UHCI_REG_Q6_WORD1_REG,    0x60014068
.equ UHCI_ESC_CONF0_REG,       0x6001406C
.equ UHCI_ESC_CONF1_REG,       0x60014070
.equ UHCI_ESC_CONF2_REG,       0x60014074
.equ UHCI_ESC_CONF3_REG,       0x60014078
.equ UHCI_PKT_THRES_REG,       0x6001407C
# UHCI Interrupt Register
.equ UHCI_INT_RAW_REG,         0x60014004
.equ UHCI_INT_ST_REG,          0x60014008
.equ UHCI_INT_ENA_REG,         0x6001400C
.equ UHCI_INT_CLR_REG,         0x60014010
# UHCI Status Register
.equ UHCI_STATE0_REG,          0x60014018
.equ UHCI_STATE1_REG,          0x6001401C
.equ UHCI_RX_HEAD_REG,         0x6001402C
# Version Register
.equ UHCI_DATE_REG,            0x60014080
######################################################

######################################################
# SPI Controller (SPI)
# (TRM 627)
# (note: inserted a 2 to the register names)
######################################################
.equ SPI0_BASE,               0x60003000 # not usable?
.equ SPI1_BASE,               0x60002000 # not usable?
.equ SPI2_BASE,               0x60024000
# User-defined control registers
.equ SPI2_CMD_REG,            0x60024000
.equ SPI2_ADDR_REG,           0x60024004
.equ SPI2_USER_REG,           0x60024010
.equ SPI2_USER1_REG,          0x60024014
.equ SPI2_USER2_REG,          0x60024018
# Control and configuration registers
.equ SPI2_CTRL_REG,           0x60024008
.equ SPI2_MS_DLEN_REG,        0x6002401C
.equ SPI2_MISC_REG,           0x60024020
.equ SPI2_DMA_CONF_REG,       0x60024030
.equ SPI2_SLAVE_REG,          0x600240E0
.equ SPI2_SLAVE1_REG,         0x600240E4
# Clock control registers
.equ SPI2_CLOCK_REG,          0x6002400C
.equ SPI2_CLK_GATE_REG,       0x600240E8
# Timing registers
.equ SPI2_DIN_MODE_REG,       0x60024024
.equ SPI2_DIN_NUM_REG,        0x60024028
.equ SPI2_DOUT_MODE_REG,      0x6002402C
# Interrupt registers
.equ SPI2_DMA_INT_ENA_REG,    0x60024034
.equ SPI2_DMA_INT_CLR_REG,    0x60024038
.equ SPI2_DMA_INT_RAW_REG,    0x6002403C
.equ SPI2_DMA_INT_ST_REG,     0x60024040
# CPU-controlled data buffer
.equ SPI2_W0_REG,             0x60024098
.equ SPI2_W1_REG,             0x6002409C
.equ SPI2_W2_REG,             0x600240A0
.equ SPI2_W3_REG,             0x600240A4
.equ SPI2_W4_REG,             0x600240A8
.equ SPI2_W5_REG,             0x600240AC
.equ SPI2_W6_REG,             0x600240B0
.equ SPI2_W7_REG,             0x600240B4
.equ SPI2_W8_REG,             0x600240B8
.equ SPI2_W9_REG,             0x600240BC
.equ SPI2_W10_REG,            0x600240C0
.equ SPI2_W11_REG,            0x600240C4
.equ SPI2_W12_REG,            0x600240C8
.equ SPI2_W13_REG,            0x600240CC
.equ SPI2_W14_REG,            0x600240D0
.equ SPI2_W15_REG,            0x600240D4
# Version register
.equ SPI2_DATE_REG,           0x600240F0
######################################################

######################################################
# I2C Controller (I2C)
# (TRM 686)
######################################################
.equ I2C_BASE,  0x60013000
# Timing Registers
.equ I2C_SCL_LOW_PERIOD_REG,       0x60013000
.equ I2C_SDA_HOLD_REG,             0x60013030
.equ I2C_SDA_SAMPLE_REG,           0x60013034
.equ I2C_SCL_HIGH_PERIOD_REG,      0x60013038
.equ I2C_SCL_START_HOLD_REG,       0x60013040
.equ I2C_SCL_RSTART_SETUP_REG,     0x60013044
.equ I2C_SCL_STOP_HOLD_REG,        0x60013048
.equ I2C_SCL_STOP_SETUP_REG,       0x6001304C
.equ I2C_SCL_ST_TIME_OUT_REG,      0x60013078
.equ I2C_SCL_MAIN_ST_TIME_OUT_REG, 0x6001307C
# Configuration Registers
.equ I2C_CTR_REG,                  0x60013004
.equ I2C_TO_REG,                   0x6001300C
.equ I2C_SLAVE_ADDR_REG,           0x60013010
.equ I2C_FIFO_CONF_REG,            0x60013018
.equ I2C_FILTER_CFG_REG,           0x60013050
.equ I2C_CLK_CONF_REG,             0x60013054
.equ I2C_SCL_SP_CONF_REG,          0x60013080
.equ I2C_SCL_STRETCH_CONF_REG,     0x60013084
# Status Registers
.equ I2C_SR_REG,                   0x60013008
.equ I2C_FIFO_ST_REG,              0x60013014
.equ I2C_DATA_REG,                 0x6001301C
# Interrupt Registers
.equ I2C_INT_RAW_REG,              0x60013020
.equ I2C_INT_CLR_REG,              0x60013024
.equ I2C_INT_ENA_REG,              0x60013028
.equ I2C_INT_STATUS_REG,           0x6001302C
# Command Registers
.equ I2C_COMD0_REG,                0x60013058
.equ I2C_COMD1_REG,                0x6001305C
.equ I2C_COMD2_REG,                0x60013060
.equ I2C_COMD3_REG,                0x60013064
.equ I2C_COMD4_REG,                0x60013068
.equ I2C_COMD5_REG,                0x6001306C
.equ I2C_COMD6_REG,                0x60013070
.equ I2C_COMD7_REG,                0x60013074
.equ I2C_DATE_REG,                 0x600130F8
######################################################

######################################################
# I2S Controller (I2S)
# (TRM 727)
######################################################
.equ I2S_BASE,                     0x6002D000
# Interrupt registers
.equ I2S_INT_RAW_REG,              0x6002D00C
.equ I2S_INT_ST_REG,               0x6002D010
.equ I2S_INT_ENA_REG,              0x6002D014
.equ I2S_INT_CLR_REG,              0x6002D018
# RX control and configuration registers
.equ I2S_RX_CONF_REG,              0x6002D020
.equ I2S_RX_CONF1_REG,             0x6002D028
.equ I2S_RX_CLKM_CONF_REG,         0x6002D030
.equ I2S_TX_PCM2PDM_CONF_REG,      0x6002D040
.equ I2S_TX_PCM2PDM_CONF1_REG,     0x6002D044
.equ I2S_RX_TDM_CTRL_REG,          0x6002D050
.equ I2S_RXEOF_NUM_REG,            0x6002D064
# TX control and configuration registers
.equ I2S_TX_CONF_REG,              0x6002D024
.equ I2S_TX_CONF1_REG,             0x6002D02C
.equ I2S_TX_CLKM_CONF_REG,         0x6002D034
.equ I2S_TX_TDM_CTRL_REG,          0x6002D054
# RX clock and timing registers
.equ I2S_RX_CLKM_DIV_CONF_REG,     0x6002D038
.equ I2S_RX_TIMING_REG,            0x6002D058
# TX clock and timing registers
.equ I2S_TX_CLKM_DIV_CONF_REG,     0x6002D03C
.equ I2S_TX_TIMING_REG,            0x6002D05C
# Control and configuration registers
.equ I2S_LC_HUNG_CONF_REG,         0x6002D060
.equ I2S_CONF_SIGLE_DATA_REG,      0x6002D068
# TX Status Register
.equ I2S_STATE_REG,                0x6002D06C
# Version Register
.equ I2S_DATE_REG,                 0x6002D080
######################################################

######################################################
# USB Serial/JTAG Controller (USB_SERIAL_JTAG)
# (TRM 750)
######################################################
.equ USB_SERIAL_JTAG_BASE,             0x60043000
# Configuration Registers
.equ USB_SERIAL_JTAG_EP1_REG,          0x60043000
.equ USB_SERIAL_JTAG_CONF0_REG,        0x60043018
.equ USB_SERIAL_JTAG_TEST_REG,         0x6004301C
.equ USB_SERIAL_JTAG_MISC_CONF_REG,    0x60043044
.equ USB_SERIAL_JTAG_MEM_CONF_REG,     0x60043048
# Status Registers
.equ USB_SERIAL_JTAG_EP1_CONF_REG,     0x60043004
.equ USB_SERIAL_JTAG_JFIFO_ST_REG,     0x60043020
.equ USB_SERIAL_JTAG_FRAM_NUM_REG,     0x60043024
.equ USB_SERIAL_JTAG_IN_EP0_ST_REG,    0x60043028
.equ USB_SERIAL_JTAG_IN_EP1_ST_REG,    0x6004302C
.equ USB_SERIAL_JTAG_IN_EP2_ST_REG,    0x60043030
.equ USB_SERIAL_JTAG_IN_EP3_ST_REG,    0x60043034
.equ USB_SERIAL_JTAG_OUT_EP0_ST_REG,   0x60043038
.equ USB_SERIAL_JTAG_OUT_EP1_ST_REG,   0x6004303C
.equ USB_SERIAL_JTAG_OUT_EP2_ST_REG,   0x60043040
# Interrupt Registers
.equ USB_SERIAL_JTAG_INT_RAW_REG,      0x60043008
.equ USB_SERIAL_JTAG_INT_ST_REG,       0x6004300C
.equ USB_SERIAL_JTAG_INT_ENA_REG,      0x60043010
.equ USB_SERIAL_JTAG_INT_CLR_REG,      0x60043014
# Version Registers
.equ USB_SERIAL_JTAG_DATE_REG,         0x60043080
######################################################

######################################################
# Two-wire Automotive Interface (TWAI)
# (TRM 791)
######################################################
.equ TWAI_BASE,                        0x6002B000
# Configuration Registers
.equ TWAI_MODE_REG,                    0x6002B000
.equ TWAI_BUS_TIMING_0_REG,            0x6002B018
.equ TWAI_BUS_TIMING_1_REG,            0x6002B01C
.equ TWAI_ERR_WARNING_LIMIT_REG,       0x6002B034
.equ TWAI_DATA_0_REG,                  0x6002B040
.equ TWAI_DATA_1_REG,                  0x6002B044
.equ TWAI_DATA_2_REG,                  0x6002B048
.equ TWAI_DATA_3_REG,                  0x6002B04C
.equ TWAI_DATA_4_REG,                  0x6002B050
.equ TWAI_DATA_5_REG,                  0x6002B054
.equ TWAI_DATA_6_REG,                  0x6002B058
.equ TWAI_DATA_7_REG,                  0x6002B05C
.equ TWAI_DATA_8_REG,                  0x6002B060
.equ TWAI_DATA_9_REG,                  0x6002B064
.equ TWAI_DATA_10_REG,                 0x6002B068
.equ TWAI_DATA_11_REG,                 0x6002B06C
.equ TWAI_DATA_12_REG,                 0x6002B070
.equ TWAI_CLOCK_DIVIDER_REG,           0x6002B07C
# Control Registers
.equ TWAI_CMD_REG,                     0x6002B004
# Status Register
.equ TWAI_STATUS_REG,                  0x6002B008
.equ TWAI_ARB_LOST_CAP_REG,            0x6002B02C
.equ TWAI_ERR_CODE_CAP_REG,            0x6002B030
.equ TWAI_RX_ERR_CNT_REG,              0x6002B038
.equ TWAI_TX_ERR_CNT_REG,              0x6002B03C
.equ TWAI_RX_MESSAGE_CNT_REG,          0x6002B074
# Interrupt Registers
.equ TWAI_INT_RAW_REG,                 0x6002B00C
.equ TWAI_INT_ENA_REG,                 0x6002B010
######################################################

######################################################
# LED PWM Controller (LEDC)
# (TRM 812)
######################################################
.equ LEDC_BASE,                        0x60019000
# Configuration Register
.equ LEDC_CH0_CONF0_REG,               0x60019000
.equ LEDC_CH0_CONF1_REG,               0x6001900C
.equ LEDC_CH1_CONF0_REG,               0x60019014
.equ LEDC_CH1_CONF1_REG,               0x60019020
.equ LEDC_CH2_CONF0_REG,               0x60019028
.equ LEDC_CH2_CONF1_REG,               0x60019034
.equ LEDC_CH3_CONF0_REG,               0x6001903C
.equ LEDC_CH3_CONF1_REG,               0x60019048
.equ LEDC_CH4_CONF0_REG,               0x60019050
.equ LEDC_CH4_CONF1_REG,               0x6001905C
.equ LEDC_CH5_CONF0_REG,               0x60019064
.equ LEDC_CH5_CONF1_REG,               0x60019070
.equ LEDC_CONF_REG,                    0x600190D0
# Hpoint Register
.equ LEDC_CH0_HPOINT_REG,              0x60019004
.equ LEDC_CH1_HPOINT_REG,              0x60019018
.equ LEDC_CH2_HPOINT_REG,              0x6001902C
.equ LEDC_CH3_HPOINT_REG,              0x60019040
.equ LEDC_CH4_HPOINT_REG,              0x60019054
.equ LEDC_CH5_HPOINT_REG,              0x60019068
# Duty Cycle Register
.equ LEDC_CH0_DUTY_REG,                0x60019008
.equ LEDC_CH0_DUTY_R_REG,              0x60019010
.equ LEDC_CH1_DUTY_REG,                0x6001901C
.equ LEDC_CH1_DUTY_R_REG,              0x60019024
.equ LEDC_CH2_DUTY_REG,                0x60019030
.equ LEDC_CH2_DUTY_R_REG,              0x60019038
.equ LEDC_CH3_DUTY_REG,                0x60019044
.equ LEDC_CH3_DUTY_R_REG,              0x6001904C
.equ LEDC_CH4_DUTY_REG,                0x60019058
.equ LEDC_CH4_DUTY_R_REG,              0x60019060
.equ LEDC_CH5_DUTY_REG,                0x6001906C
.equ LEDC_CH5_DUTY_R_REG,              0x60019074
# Timer Register
.equ LEDC_TIMER0_CONF_REG,             0x600190A0
.equ LEDC_TIMER0_VALUE_REG,            0x600190A4
.equ LEDC_TIMER1_CONF_REG,             0x600190A8
.equ LEDC_TIMER1_VALUE_REG,            0x600190AC
.equ LEDC_TIMER2_CONF_REG,             0x600190B0
.equ LEDC_TIMER2_VALUE_REG,            0x600190B4
.equ LEDC_TIMER3_CONF_REG,             0x600190B8
.equ LEDC_TIMER3_VALUE_REG,            0x600190BC
# Interrupt Register
.equ LEDC_INT_RAW_REG,                 0x600190C0
.equ LEDC_INT_ST_REG,                  0x600190C4
.equ LEDC_INT_ENA_REG,                 0x600190C8
.equ LEDC_INT_CLR_REG,                 0x600190CC
# Version Register
.equ LEDC_DATE_REG,                    0x600190FC
######################################################

######################################################
# Remote Control Peripheral (RMT)
# (TRM 829)
######################################################
.equ RMT_BASE,                    0x60016000
# FIFO R/W Registers
.equ RMT_CH0DATA_REG,             0x60016000
.equ RMT_CH1DATA_REG,             0x60016004
.equ RMT_CH2DATA_REG,             0x60016008
.equ RMT_CH3DATA_REG,             0x6001600C
# Configuration Registers
.equ RMT_CH0CONF0_REG,            0x60016010
.equ RMT_CH1CONF0_REG,            0x60016014
.equ RMT_CH2CONF0_REG,            0x60016018
.equ RMT_CH2CONF1_REG,            0x6001601C
.equ RMT_CH3CONF0_REG,            0x60016020
.equ RMT_CH3CONF1_REG,            0x60016024
.equ RMT_SYS_CONF_REG,            0x60016068
.equ RMT_REF_CNT_RST_REG,         0x60016070
# Status Registers
.equ RMT_CH0STATUS_REG,           0x60016028
.equ RMT_CH1STATUS_REG,           0x6001602C
.equ RMT_CH2STATUS_REG,           0x60016030
.equ RMT_CH3STATUS_REG,           0x60016034
# Interrupt Registers
.equ RMT_INT_RAW_REG,             0x60016038
.equ RMT_INT_ST_REG,              0x6001603C
.equ RMT_INT_ENA_REG,             0x60016040
.equ RMT_INT_CLR_REG,             0x60016044
# Carrier Wave Duty Cycle Registers
.equ RMT_CH0CARRIER_DUTY_REG,     0x60016048
.equ RMT_CH1CARRIER_DUTY_REG,     0x6001604C
.equ RMT_CH2_RX_CARRIER_RM_REG,   0x60016050
.equ RMT_CH3_RX_CARRIER_RM_REG,   0x60016054
# TX Event Configuration Registers
.equ RMT_CH0_TX_LIM_REG,          0x60016058
.equ RMT_CH1_TX_LIM_REG,          0x6001605C
.equ RMT_TX_SIM_REG,              0x6001606C
# RX Event Configuration Registers
.equ RMT_CH2_RX_LIM_REG,          0x60016060
.equ RMT_CH3_RX_LIM_REG,          0x60016064
# Version Register
.equ RMT_DATE_REG,                0x600160CC
######################################################

######################################################
# On-Chip Sensor and Analog Signal Processing
# (TRM 854)
######################################################
.equ ADC_BASE, 0x60040000
# Configuration Registers
.equ APB_SARADC_CTRL_REG,              0x60040000
.equ APB_SARADC_CTRL2_REG,             0x60040004
.equ APB_SARADC_FILTER_CTRL1_REG,      0x60040008
.equ APB_SARADC_SAR_PATT_TAB1_REG,     0x60040018
.equ APB_SARADC_SAR_PATT_TAB2_REG,     0x6004001C
.equ APB_SARADC_ONETIME_SAMPLE_REG,    0x60040020
.equ APB_SARADC_APB_ADC_ARB_CTRL_REG,  0x60040024
.equ APB_SARADC_FILTER_CTRL0_REG,      0x60040028
.equ APB_SARADC_1_DATA_STATUS_REG,     0x6004002C
.equ APB_SARADC_2_DATA_STATUS_REG,     0x60040030
.equ APB_SARADC_THRES0_CTRL_REG,       0x60040034
.equ APB_SARADC_THRES1_CTRL_REG,       0x60040038
.equ APB_SARADC_THRES_CTRL_REG,        0x6004003C
.equ APB_SARADC_INT_ENA_REG,           0x60040040
.equ APB_SARADC_INT_RAW_REG,           0x60040044
.equ APB_SARADC_INT_ST_REG,            0x60040048
.equ APB_SARADC_INT_CLR_REG,           0x6004004C
.equ APB_SARADC_DMA_CONF_REG,          0x60040050
.equ APB_SARADC_APB_ADC_CLKM_CONF_REG, 0x60040054
.equ APB_SARADC_APB_TSENS_CTRL_REG,    0x60040058
.equ APB_SARADC_APB_TSENS_CTRL2_REG,   0x6004005C
.equ APB_SARADC_CALI_REG,              0x60040060
.equ APB_SARADC_APB_CTRL_DATE_REG,     0x600403FC
######################################################
